{
  "_meta": {
    "sources": [
      {
        "json": "RacialFeatsExpandedFedor",
        "abbreviation": "RFE",
        "full": "Racial Feats Expanded",
        "authors": [
          "Feodor Romanenkov"
        ],
        "convertedBy": [
          "Senort11"
        ],
        "version": "1.0.0",
        "url": "https://www.dmsguild.com/product/314753/Racial-Feats-Expanded",
        "targetSchema": "1.1.2"
      }
    ],
    "dateAdded": 1539373091,
    "dateLastModified": 1539373091
  },
  "feat": [
    {
      "name": "Sky Warden",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "aarakocra"
            }
          ]
        }
      ],
      "entries": [
        "You are trained for both scouting the skies and aerial combat. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "You gain proficiency in the Perception skill if you don't already have it. You add double your proficiency bonus to Perception checks that rely on sight.",
            "Once per turn, if you are flying and dive at least 30 feet straight toward a target and then hit it with a melee weapon attack, the attack deals an extra {@dice 1d6} damage to the target."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "dex",
              "wis"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Aerial Scout",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "aarakocra"
            }
          ]
        }
      ],
      "entries": [
        "Specializing in scouting in the skies, you gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Keen Senses.} You gain proficiency with the Perception skill if you're not already proficient. Additionally, You have advantage on Wisdom (Perception) checks that rely on hearing or sight.",
            "{@b Quick Glance.} You can use the Search action as a free action."
          ]
        }
      ],
      "ability": [
        {
          "dex": 1
        }
      ]
    },
    {
      "name": "Avian Warfare",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "aarakocra"
            }
          ]
        }
      ],
      "entries": [
        "You've trained in Aarakocra combat techniques, gaining the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Dive Attack}. If you are flying and dive at least 30 feet straight toward a target and then hit it with a melee weapon attack, the attack deals an extra 1d6 damage to the target.",
            "{@b Flyby.} You don't provoke an opportunity attack when youfly out of an enemy's reach.",
            "{@b Improved Talons.} Your talons gain the finesse property."
          ]
        }
      ]
    },
    {
      "name": "Mastery of Air",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "aarakocra"
            }
          ]
        }
      ],
      "entries": [
        "Your time in the skies has given you not just an understanding of the flow of the winds, but some limited control of them. You learn the {@spell Gust|xge} cantrip and the {@spell Gust of Wind} spell. You may cast Gust of Wind without expending a spell slot or material components. Wisdom is your spellcasting ability for both spells. Once you have cast Gust of Wind with this feature, you must complete a short or long rest before you can use it again."
      ]
    },
    {
      "name": "Angelic Protection",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "aasimar"
            }
          ]
        }
      ],
      "entries": [
        "The innate resistance to magic that angels possess extends to you. You have advantage on saving throws against spells and other magical effects."
      ]
    },
    {
      "name": "Divine Recovery",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "aasimar"
            }
          ]
        }
      ],
      "entries": [
        "You learn to utilize divine healing to assist you and your party. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Divine Touch.} Your Healing Hands feature can be used asa bonus action, and you can use it with a range of 30 feet.",
            "{@b Heavenly Influence.} Whenever a creature you can seeregains Hit Points, you can use your reaction for them toregain additional Hit Points equal to your Charisma orWisdom modifier, whichever is higher. You can use thisfeature once, and regain the ability to do so whenever youfinish a short or long rest."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "cha",
              "wis"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Child of the Divine",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "aasimar (protector)"
            }
          ]
        }
      ],
      "entries": [
        "You learn to utilize divine healing to assist you and your party. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Divine Aid.} Whenever you fail a saving throw, you can choose to succeed instead. Once you use this feature, you cannot do so again until you finish a long rest"
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "cha",
              "wis"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Radiant Warrior",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "aasimar (scourge)"
            }
          ]
        }
      ],
      "entries": [
        "You've become a divine warrior, comparable to the likes of a deva. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Angelic Strikes.} When you score a critical hit with amelee weapon attack, you can deal additional radiant damage equal to your Charisma modifier.",
            "{@b Radiant Smite.} You can cast the {@spell wrathful smite} spell once, without expending a spell slot. Once you do so, you cannot use this feature again until you finish a short orlong rest. Charisma is your spellcasting ability for this spell."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "con",
              "cha"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Demi-Shaytan",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "aasimar (fallen)"
            }
          ]
        }
      ],
      "entries": [
        "Touched by evil influences, you gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Fiendish Strikes.} When you score a critical hit with a melee weapon attack, you deal additional necrotic damage equal to your Charisma modifier.",
            "{@b Life Drain.} Your {@i Healing Hands} feature doesn't heal Hit Points, rather the target must succeed on a Constitution saving throw (DC = 8 + your proficiency modifier + your Charisma modifier) or take necrotic damage equal to your level (half damage on a success). You regain Hit Points equal to the damage dealt."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "con",
              "cha"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Well-Rested",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "bugbear"
            }
          ]
        }
      ],
      "entries": [
        "Your practiced napping leaves you invigorated when you are awake. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "Whenever you spend one or more hit dice during a short rest, you can regain an extra {@dice 1d6} hit points.",
            "At the end of a long rest, you gain inspiration (described in chapter 4 of the Player's Handbook)."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "dex",
              "str"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Child of Hruggek",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "bugbear"
            }
          ]
        }
      ],
      "entries": [
        "Blessed by the bugbear god of ambush, violence, and combat; you gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Heart of Hruggek.} You have advantage on saving throwsagainst being charmed, frightened, paralyzed, poisoned,stunned, or put to sleep."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "dex",
              "str"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Brute",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "bugbear"
            }
          ]
        }
      ],
      "entries": [
        "You are good with your hands... well, at using them to killthings at least. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Heavy Blow.} As a bonus action, you can have your weapon attacks dealtwice the number of damage die that they normally do thisturn. You may use this feature a number of times equal toyour Strength modifier (minimum of 1) before needing to complete a long rest to recharge all expended uses."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "dex",
              "str"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Equine Skirmisher",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "centaur"
            }
          ]
        }
      ],
      "entries": [
        "You've perfected the fighting style of Centaurs, gaining the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Skirmish.} You have advantage on the first attack roll of your turn if you have moved to a space at least 15 feet from the space you occupied at the start of your turn.",
            "{@b Equine Form.} A Medium or smaller creature can ride onyour equine back if you allow it. In such a situation, youcontinue to act independently, not as a controlled mount."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "str",
              "wis"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Grand Galloper",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "centaur"
            }
          ]
        }
      ],
      "entries": [
        "Your legs grow even stronger from hard training or extended use, and you feel even faster than before. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Gallop.} You can Dash as a Bonus Action. Opportunity attacks made against you while dashing are made at disadvantage.",
            "{@b Magical Hooves.} Your hooves now count as magical for the purposes of overcoming resistance."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "dex",
              "str"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Unicorn Magic",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "centaur"
            }
          ]
        }
      ],
      "entries": [
        "Your family is one of the few lucky enough to have a bloodline with a unicorn ancestor. Once dormant magic now courses through your veins, providing you with spellcasting typical of unicorns. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Unicorn Bloodline.} You can choose to grow a small unicorn horn on your forehead, or a larger horn if you already have one.",
            "{@b Fey Magic.} You learn the cantrip {@spell Druidcraft}, and the spells {@spell Entangle} and {@spell Shield of Faith}, both of which you can cast once without expending a spell slot. You can cast each of these spells without expending a spell slot. Once you cast either of these spells in this way, you can’t cast that spell in this way again until you finish a long rest. You can also cast these spells using spell slots you have of the appropriate level. The spells’ spellcasting ability is the ability increased by this feat (Intelligence or Wisdom)."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "int",
              "wis"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Unsettling Visage",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "changeling"
            }
          ]
        }
      ],
      "entries": [
        {
          "type": "list",
          "items": [
            "Being able to shapeshift at will, you are able to subtly change before an enemy, unsettling them",
            "When a creature you can see makes an attack roll against you, you can use your reaction to impose disadvantage on the roll. You must use this feature before knowing whether the attack hits or misses. Using this trait reveals your shapeshifting nature to any creature within 30 feet that can see you.",
            "Once you use this trait, you can’t use it again until you finish a short or long rest."
          ]
        }
      ],
      "ability": [
        {
          "cha": 1
        }
      ]
    },
    {
      "name": "Chameleon",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "changeling"
            }
          ]
        }
      ],
      "entries": [
        "Your shapechanging is so complex, that it is hard to see through it even by magical means. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Anti-magic Visage.} You have advantage on Saving Throw agains divination effects.",
            "{@b Unscryable.} You can cast the {@spell Nondetection} spell on yourself once without expending a spell slot or material components once. Once you cast the spell in this way, you can’t cast the spell in this way again until you finish a long rest."
          ]
        }
      ],
      "ability": [
        {
          "cha": 1
        }
      ]
    },
    {
      "name": "Identity Thief",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "changeling"
            }
          ]
        }
      ],
      "entries": [
        "You have a natural facility to create, remember and steal all kind of identities. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Perfect Impersonation.} You can perfectly mimic other creatures you've met. When impersonating another creature, you gain advantage on Charisma (Deception and Persuasion) checks that involve that creature's identity.",
            "{@b Smooth Talker.} You gain proficiency in either Deception or Persuasion. If you already have proficiency in the selected skill, you gain expertise instead."
          ]
        }
      ],
      "ability": [
        {
          "cha": 1
        }
      ]
    },
    {
      "name": "Bursting Breath",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "dragonborn"
            }
          ]
        }
      ],
      "entries": [
        "You are one of the rare dragonborn who have learned to shape and condense their breath weapon before unleashing it. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Exploding Breath.} You can use your breath weapon to shoot a ball of energy from your mouth that explodes in an area of effect blast. It has a range of 60 feet and the explosion has a radius of 10 feet."
          ]
        }
      ]
    },
    {
      "name": "Breath of the Ancients",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "dragonborn"
            }
          ]
        }
      ],
      "entries": [
        "The blood of dragons runs purer in your veins than other dragon born. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Empowered Breath.} The damage dice for your Breath Weapon are now d8s.",
            "{@b Ancestral Breath.} You can spend a bonus action on your turn to call on the latent power of the ancient dragon blood in your veins. Your breath weapon becomes a Recharge (6) ability rather than having one use per short or long rest. After you use your dragon breath, roll {@dice 1d6} on the beginning of your next turn. On a 6, your breath weapon instantly recharges. Your breath weapon can continue to recharge in this way for 10 minutes. Once you've used your breath in this way, your Breath Weapon cannot be used again until you take a long rest."
          ]
        }
      ]
    },
    {
      "name": "Natural Artisan",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "dwarf, elf, gnome"
            }
          ]
        }
      ],
      "entries": [
        "Being a part of a race with some of the finest artisans in the world, you gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Right Tool for the Job.} You gain profieciency with two artisan's tools of your choice.",
            "{@b Tool Master.} Choose one artisan's tool of which you're proficient in. Your proficiency bonus is doubled for any ability checkmade with this tool."
          ]
        }
      ],
      "ability": [
        {
          "int": 1
        }
      ]
    },
    {
      "name": "Master of the Forge",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "dwarf"
            }
          ]
        }
      ],
      "entries": [
        " You can create masterwork weapons and armor when forging an item. A masterwork item costs five times as much as an ordinary item of its type and has the following properties, unless it is a magical item.",
        {
          "type": "list",
          "items": [
            "{@b Masterwork Weapon.} You have +1 on attack rolls made with a masterwork weapon.",
            "{@b Masterwork Armor.} Light masterwork armor is hardened and gains +1 AC. Medium masterwork armor does not produce as much noise, its wearer does not have disadvantage on Stealth rolls. Heavy masterwork armor is properly weighted, and grants advantage to its wearer on checks and saves made to avoid being knocked prone, or to resist being pushed.",
            "{@b Magical Forge Master.} Upon reaching 6th level, you can use a magic item as a base for Master Weapon and Masterwork Armor at an additional two times the cost and still gain the benefits on the item."
          ]
        }
      ]
    },
    {
      "name": "Duergar Work Ethic",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "dwarf (duergar)"
            }
          ]
        }
      ],
      "entries": [
        "Endless work and toil is the Duergar way of life. You can continue onward, ignoring the aches and pains of your tired body until you cannot go on. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Tireless.} You suffer no penalities from the first and second level of exhuastion. Upon reaching the third level of exhuastion or higher, you now suffer from level 1 and 2 exhuastion effects.",
            "{@b Right Back to It.} You can spend hit dice on a long rest to recover from an additional level of exhaustion. The number of dice that can be spent is 1/4 of your character level rounded down."
          ]
        }
      ]
    },
    {
      "name": "Of the Seelie",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "elf (eladrin)"
            }
          ]
        }
      ],
      "entries": [
        "With your connection to the courts of the Feywild, you gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Improved Fey Step.} You can use your Fey Step feature twice before needing torest.",
            "{@b Short Seasons.} You can change your season during a short rest."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "cha",
              "int"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Aquatic Elf Magic",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "elf (sea)"
            }
          ]
        }
      ],
      "entries": [
        "You learn the magic of sea, from where you and your people come from. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Sea Magic.} You learn the {@spell shape water|xge} cantrip. You also learn the {@spell create or destroy water} and {@spell fog cloud} spells, each of which you can cast once without expending a spell slot. You regain the ability to cast these two spells in this way when you finish a long rest. Wisdom is your spellcasting ability for all three spells."
          ]
        }
      ]
    },
    {
      "name": "Raven's Gift",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "elf (shadar-kai)"
            }
          ]
        }
      ],
      "entries": [
        "Blessed by a deity of death, you gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Undying Devotee.} You have advantage on death saving throws.",
            "{@b Not Their Time.} You learn the {@spell Spare the Dying} cantrip."
          ]
        }
      ],
      "ability": [
        {
          "con": 1
        }
      ]
    },
    {
      "name": "Firbolg Beast Magic",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "firbolg"
            }
          ]
        }
      ],
      "entries": [
        "Your connection to animals deepens. You learn the {@spell speak with animals} spell and can cast it at will, without expending a spell slot. You also learn the {@spell animal friendship} and {@spell beast sense} spells, each of which you can cast once without expending a spell slot. You regain the ability to cast these two spells in this way when you finish a long rest. Wisdom is your spellcasting ability for all three spells."
      ]
    },
    {
      "name": "Firbolg Beast Magic",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "firbolg"
            }
          ]
        }
      ],
      "entries": [
        "Your connection to animals deepens. You learn the {@spell speak with animals} spell and can cast it at will, without expending a spell slot. You also learn the {@spell animal friendship} and {@spell beast sense} spells, each of which you can cast once without expending a spell slot. You regain the ability to cast these two spells in this way when you finish a long rest. Wisdom is your spellcasting ability for all three spells."
      ]
    },
    {
      "name": "Firbolg Rage",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "firbolg"
            }
          ]
        }
      ],
      "entries": [
        "Your people are anything but confrontational, but when all else fails, a primal force awakens within you and destruction will be wrough at any cost. As a bonus action, you may enter a Firbolg Rage which lasts up to a minute, until you are unconscious, or until you end it on a subsequent turn as abonus action.. While in this state, you deal double the damage you normally would, but take double damage as well."
      ]
    },
    {
      "name": "Steward of Nature",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "firbolg"
            }
          ]
        }
      ],
      "entries": [
        "You find that you are able to draw upon the strength of the land and its natural energies. The land grants you its power so that you may protect it. You learn the {@spell druidcraft} cantrip. When selecting this feat, you also learn one 1st level druid spell of your choice and one 2nd level druid spell of your choice. You always have these spells prepared and do not need to consume material components or spell slots to castthem. You may cast the 1st level spell two times before youmust complete a long rest to recharge your uses of it. The 2nd level spell may only be cast once before you mustcomplete a long rest to recharge its use. Wisdom is your spell casting modifer for this spell (see Druid class for spell DCs)."
      ]
    },
    {
      "name": "Djinn Heritage",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "genasi (air)  "
            }
          ]
        }
      ],
      "entries": [
        "You manifest more of the magical power of your djinn heritage. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "You learn the {@spell detect magic} spell and can cast it at will, without expending a spell slot.",
            "You have resistance to lightning and thunder damage."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "dex",
              "con"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Djinn Legacy",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "genasi (air)  "
            }
          ]
        }
      ],
      "entries": [
        "Your connection to the Elemental Plane of Air is heightened. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Lighter than Air.} You gain a flying speed of 15 feet. To use this speed, you cannot be wearing medium or heavy armor and you cannot be encumbered.",
            "{@b Strong Gust.} You learn the @{spell gust|xge} cantrip if you don't already know it. Constitution is your spell casting ability for it. Additionally, whenever you push a creature with this spell, they get pushed 10 feet, rather than 5, and you can push them in any direction."
          ]
        }
      ],
      "ability": [
        {
          "dex": 1
        }
      ]
    },
    {
      "name": "Dao Heritage",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "genasi (earth)"
            }
          ]
        }
      ],
      "entries": [
        "You manifest more of the magical power of your dao heritage. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "You learn the {@spell detect magic} spell and can cast it at will, without expending a spell slot.",
            "You gain natural armor. While you aren't wearing armor, you can calculate your AC as 13 + your Dexterity modifier. You can use a {@item shield} and still gain this benefit."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "str",
              "con"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Dao Legacy",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "genasi (earth)  "
            }
          ]
        }
      ],
      "entries": [
        "Your connection to the Elemental Plane of Earth is heightened. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Unarmored Defense.} When not wearing armor, your AC is calculated as 13 + your Constitution modifier. You can use a {@item shield} and still gain this benefit.",
            "{@b Earth Shaper.} You learn the {@spell mold earth|xge} cantrip if you don't already know it. Constitution is your spellcasting ability for this spell."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "str",
              "con"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Efreeti Heritage",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "genasi (fire) "
            }
          ]
        }
      ],
      "entries": [
        "You manifest more of the magical power of your efreet heritage. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "You learn the {@spell detect magic} spell and can cast it at will, without expending a spell slot.",
            "Your darkvision has a radius of 120 feet"
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "con",
              "int"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Efreeti Legacy",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "genasi (fire)  "
            }
          ]
        }
      ],
      "entries": [
        "Your connection to the Elemental Plane of Fire is heightened. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Elemental Fire.} You can cast the {@spell flame blade} and {@spell scorching ray} spells each without expending a spell slot. Once you cast a spell this way, you cannot do so again until you finish a long rest. Intelligence is your spellcasting ability for these spells.",
            "{@b Natural Heat.} Due to your radiating heat, you gain resistance to cold damage."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "con",
              "int"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Marid Heritage",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "genasi (water)"
            }
          ]
        }
      ],
      "entries": [
        "You manifest more of the magical power of your marid heritage. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "You learn the {@spell detect magic} spell and can cast it at will, without expending a spell slot.",
            "You have resistance to cold damage."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "con",
              "wis"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Marid Legacy",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "genasi (water)  "
            }
          ]
        }
      ],
      "entries": [
        "Your connection to the Elemental Plane of Water is heightened. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Watery Core.} You gain advantage on saving throws for effects that deal fire damage.",
            "{@b Water Cannon.} You can use your action to shoot water in a 30-foot line that is 5 feet wide. Each creature in that line must make a Dexterity saving throw (DC = 8 + your proficiency modifier + your Constitution modifier). On a failure, a target takes {@dice 2d8} bludgeoning damage and, if it is Huge or smaller, is pushed up to 10 feet away from you and knocked prone. On a success, a target takes half the bludgeoning damage, but is neither pushed nor knocked prone."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "con",
              "wis"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Draw Element",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "genasi (water)  "
            }
          ]
        }
      ],
      "entries": [
        "By focusing your energies, you are able to enhance your elemental powers. Depending on your subrace, you gain one of the following abilities as detailed on the Draw Element Table below. After using one of these features, you must finish a long rest before using that feature again.",
        {
          "type": "table",
          "caption": "Draw Element Table",
          "colLabels": [
            "Genasi Subrace",
            "Ability"
          ],
          "colStyles": [
            "col-4 text-center",
            "col-8 text-center "
          ],
          "rows": [
            [
              "{@b Air.}",
              "As a bonus action, you lighten your step with a touch of wind. Your speed is doubled until the end of your turn."
            ],
            [
              "{@b Earth.}",
              "As a reaction when you would take damage, your body hardens to protect you. You gain resistance to all damage types except psychic until the start of your next turn."
            ],
            [
              "{@b Fire.}",
              "As a bonus action, you hone your attention on your task much like a flame is focused to a white hot point. Your proficiency bonus is tripled for one skill of your choice for the next 1 minute."
            ],
            [
              "{@b Water.}",
              "As a bonus action, you are able to center yourself to prepare for your next strike. You gain advantage on attack rolls you make this turn."
            ]
          ]
        }
      ],
      "ability": [
        {
          "con": 1
        }
      ]
    },
    {
      "name": "Psi Disciple",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "Gith"
            }
          ]
        }
      ],
      "entries": [
        "Your psionic training is more advanced than most Gith. Choose one cantrip from the Sorcerer spell list. You can cast this spell without any components. Additionally, choose two 1st-leveled spells from the Sorcerer spell list. You can cast each at will without expending a spell slot and without any components. Once you cast either spell this way, you cannot do so again until you finish a long rest. Intelligence is your spellcasting ability for these spells."
      ]
    },
    {
      "name": "Silver Sword Adept",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "Gith (Githyanki)"
            }
          ]
        }
      ],
      "entries": [
        "You learned to respect a silver sword as a priceless relic and a work of art. You have learned how to channel the force of your will with one of these relics in your hands.",
        {
          "type": "list",
          "items": [
            "{@b Githyanki Sword Training.} You gain proficiency with the greatsword.",
            "{@b Silvered Expertise.} When using a silvered weapon, add +1 to both attack and damage rolls."
          ]
        }
      ],
      "ability": [
        {
          "str": 1
        }
      ]
    },
    {
      "name": "Zerth Adept",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "Gith (Githyanki)"
            }
          ]
        }
      ],
      "entries": [
        "You have full knowledge of the Unbroken Circles of Zerthimon, and followed all his teaching and principles with discipline. Your senses are enhanced and you gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Githzerai Blindfold Training.} You have blindsight, perceiving your surrounding without relying on sight, within a radius of 20 feet. While in your blindsight radius, any negative effect of the Blinded condition is ignored."
          ]
        }
      ],
      "ability": [
        {
          "dex": 1
        }
      ]
    },
    {
      "name": "Advanced Psionics",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "Gith"
            }
          ]
        }
      ],
      "entries": [
        "You have recieved avdvanced training in psionic abilities. You gain the following benefits.",
        {
          "type": "list",
          "items": [
            "{@b Psi Warrior.} As a bonus action on your turn, you can imbue your weapons with psionic force. For 1 minute, you can choose one damage roll per turn and add 1d4 psychic damage to the total damage. After using this feature, you must complete a long rest before you can use it again.",
            "{@b Blurring Reality}. You learn the {@spell blur} spell. You can cast this spell as part of your Psionics trait. You regain the ability to do so after a long rest."
          ]
        }
      ],
      "ability": [
        {
          "str": 1
        }
      ]
    },
    {
      "name": "Tree Hopper",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "gnome (forest)"
            }
          ]
        }
      ],
      "entries": [
        "You have spent most of your life in the forest. Moving around amongst the trees is second nature to you. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "You may use your action to climb a tree and move from it to another tree within 50 feet. Both trees must be living and at least the same size as you. You must use 5 feet of movement to enter a tree. You appear in a spot of your choice within 5 feet of the destination tree, using another 5 feet of movement (10 feet of movement total). If you have no movement left, you appear within 5 feet of the tree you entered. You can use this transportation ability twice, regaining expended uses on a short or long rest."
          ]
        }
      ]
    },
    {
      "name": "Gnomish Transformation",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "gnome"
            }
          ]
        }
      ],
      "entries": [
        "You may use your action to transform into the shape of a mushroom, a small shrub or a bright wooden figurine of a gnome. While in this form you cannot speak or perform any actions, and your speed becomes 0. You gain advantage on stealth checks made to hide in natural terrain while in this form. You can end this effect as a reaction."
      ]
    },
    {
      "name": "Jewelcraft",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "gnome (rock)"
            }
          ]
        }
      ],
      "entries": [
        "You gain proficiency in jeweler's tools. When you are working with jeweler's tools you can work twice as quickly on nonmagical items. In addition, you are able to craft common and uncommon magic items that are amulets, beads, eyes, gems, rings, or necklaces. Common magic items require 50 gp of raw materials (or more depending on GM discretion), 1 exotic material, and take 8 hours to craft. Uncommon magic items require 200 gp of raw materials, 2 exotic materials and 2 workweeks to craft. You may have up to three magic items you have crafted using this trait at one time. You can dissassemble a magic item you have crafted using this trait to salvage raw materials worth half its crafting price. Disassembling a magic item you have crafted in this way takes 8 hours."
      ]
    },
    {
      "name": "Like a Boss",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "goblin"
            }
          ]
        }
      ],
      "entries": [
        "You are accustomed to using others as a distraction to avoid being attacked. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Goblin Tactics.} When a creature you can see targets you with an attack and another creature is within 5 feet of you, you can use your reaction to impose disadvantage on the attack roll. Once you use this ability, you can't do so again until you finish a short or long rest."
          ]
        }
      ],
      "ability": [
        {
          "dex": 1
        }
      ]
    },
    {
      "name": "Malicious Tactics",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "goblin"
            }
          ]
        }
      ],
      "entries": [
        "You are accustomed to using others as a shield to avoid being attacked. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Goblin Manuevering.} When a creature you can see targets you with an attack, you can use your reaction to choose another creature within 5 feet of it. You and that creature swap places, and the chosen creature becomes the target instead. You can use this feature a number of times equal to your proficiency modifier divided by 2 rounded down (minimum of 1 use), and regain all uses whenever you finish a long rest."
          ]
        }
      ]
    },
    {
      "name": "Chaos Reveler",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "goblin"
            }
          ]
        }
      ],
      "entries": [
        "Your fighting style has developed in the madness and chaos of all-out goblin war. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Goblin Frenzy.} For each creature you deal damage to beyond the first with melee weapon attacks, you deal {@dice 1d6} additional damage to it (the 2nd creature you damage takes {@dice 1d6} extra, the third takes {@dice 2d6} extra etc.)."
          ]
        }
      ],
      "ability": [
        {
          "dex": 1
        }
      ]
    },
    {
      "name": "Mountain's Endurance",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "goliath"
            }
          ]
        }
      ],
      "entries": [
        "Your ability to shrug off some injuries is legendary, even for your race. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "When you use your Stone's Endurance trait as a reaction to reduce damage, instead of rolling a d12 and adding your Constitution modifier, you can choose to gain resistance to the triggering attack's damage type until the start of your next turn. If the triggering attack deals more than one type of damage, choose one. As normal, after you use this trait, you can't use it again until you finish a short or long rest."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "str",
              "con"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Self-Competition",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "goliath"
            }
          ]
        }
      ],
      "entries": [
        "Your greatest competitor is yourself, constantly looking to grow. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b You Can Do Better.} Whenever you make two attacks in a row (not necessarily on the same turn), you can choose to roll {@dice 1d6} and add it to the attack and damage rolls of the second attack. You can use this feature after you roll, but before your DM tells you if you succeed or not. If your second attack does at least double the damage of the first, this ability instantly recharges and the damage die increases by one size. You can chain together multiple uses of this ability assuming you keep doubling damage. Once you use this feature, you cannot do so again until you finish a short or long rest."
          ]
        }
      ]
    },
    {
      "name": "Giant's Strength",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "goliath"
            }
          ]
        }
      ],
      "entries": [
        "The mighty blood of giants runs through your veins. Your strength is greater than any other race among the realms. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Overwhelming Strength.} When you add your Strength modifier to a damage roll, you add your Strength modifier plus 1/2 of your Strength modifier (rounded up) to the damage instead."
          ]
        }
      ],
      "ability": [
        {
          "str": 1
        }
      ]
    },
    {
      "name": "Improved Lightfoot Stealth",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "halfling (lightfoot)"
            }
          ]
        }
      ],
      "entries": [
        "You can slip away from sight with ease in crowds whether that's a crowd of gnomes or goliaths. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Disappearing Act.} You can attempt to hide even when you are only partially obscured by a creature that is your size or larger.",
            "{@b Improved Stealth.} You gain advantage on Dexterity (Stealth) rolls when you are partially or fully obscured."
          ]
        }
      ]
    },
    {
      "name": "Improved Stout Toughness",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "halfling (stout)"
            }
          ]
        }
      ],
      "entries": [
        "Your ability to shrug off poison and infection is great even among stout halflings. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Strong Immune Response.} You have advantage on saving throws against poison and disease, and you have resistance to poison damage and damaging symptoms of diseases.",
            "{@b Built Tough.} You gain half proficiency in Constitution Saving Throws. If you are already proficient, then add an additional half your proficiency bonus rounded down to your Constitution Saving Throws."
          ]
        }
      ]
    },
    {
      "name": "Adventuring Spirit",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "halfling"
            }
          ]
        }
      ],
      "entries": [
        "You can't resist the call to adventure and you've been on a few in your time. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Good Eye.} You have advantage on Wisdom (Perception) and Intelligence (Investigation) made to detect the presence of secret doors.",
            "{@b Better Reactions.} You have advantage on saving throws to avoid traps.",
            "{@b Eager Adventurer} Your brash eagerness to take on quests that will take you to new places is endearing to those who ask for your help. You have advantage on Wisdom (Insight) and Charisma (Persuasion) checks when trying to gather information from people who have given you a task about said task."
          ]
        }
      ]
    },
    {
      "name": "Brutish Skill",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "half-orc"
            }
          ]
        }
      ],
      "entries": [
        "The mix of your human ingenuity and savage orc strength makes your combat techniques more effective. You gain the following benefit:",
        {
          "type": "list",
          "items": [
            "{@b Unrefined Prowess.} When you deal damage with a melee weapon, you can add your proficiency bonus to the damage roll."
          ]
        }
      ]
    },
    {
      "name": "Uphold the Legion",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "hobgoblin"
            }
          ]
        }
      ],
      "entries": [
        "You were born for life in the legion. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "You can deal an extra {@dice 2d6} damage to a creature you hit with a weapon attack if that creature is within 5 feet of an ally that isn't incapacitated. You can use this trait only once per combat.",
            "You can extend the benefit of your Saving Face trait to an ally. As a reaction, if an ally misses with an attack roll or fails an ability check or a saving throw, you can grant a bonus to the roll equal to the number of allies your ally can see within 30 feet (including you, maximum bonus of +5). As normal, once you use this trait, you can't use it again until you finish a short or long rest."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "con",
              "int"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Line Commander",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "hobgoblin"
            }
          ]
        }
      ],
      "entries": [
        "You learned to lead front line troops experty. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Frontline Tactics.} When you are within 5 feet of an ally of your choice, both you and your ally gain +2 to attack rolls. This benefit extends to all allies on the straight line formed by you and your selected ally (think shieldwall).",
            "{@b No Openings.} Whenever you or an ally who are recieving the Frontline Tactics benefit gets hit with a melee attack, all allies within 5 feet that have the Frontline Tactics benefit may use their reaction to make an opportunity attack."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "con",
              "int"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Natural Leadership",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "hobgoblin"
            }
          ]
        }
      ],
      "entries": [
        "As a hobgoblin you are familiar with the art of war and have an innate understanding of leading troops in batte. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Commanding Officer.} As an action, you may have a single ally within 60 feet take the dodge action, disengage action, attack action, or move up to their movement speed."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "cha",
              "wis"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Short Lived",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "human"
            }
          ]
        }
      ],
      "entries": [
        "The life of a human is nasty, brutish, and short but you'll be damned if you don't make your mark. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Heroic Sacrifice.} If you are dropped down to 0 hitpoints, you may immediately take a turn. During this turn you may move closer to the creature that dropped you to 0 hit points, you may use a bonus action to Dash, you may take the Attack action against the creature that dropped you to 0 hitpoints, you may cast a spell that is a spell attack, and you can use any class abilities that target either yourself or the creature that dropped you 0 hit points. Any attack or damaging spell you use on this turn automatically crits. At the end of your turn, you fall unconscious, fail two death saving throws automatically, and must immediately make a death saving throw with disadvantage. This ability cannot be used again.",
            "{@b Heroic Triumph.} If you survive making a Heroic Sacrifice, you immediately recieve an Ability Score Improvement and feat of your choice."
          ]
        }
      ]
    },
    {
      "name": "Party Link",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "kalashtar"
            }
          ]
        }
      ],
      "entries": [
        "You are able to bridge the psychic gap between other beings minds. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Hive Mind Communication.} Your Mind Link capabilities extend further through your connection to the plane of dreams. Each long rest, you may designate up to 9 willing creatures that are within 60ft of you. Each of those creatures can communicate telepathically with each other and you as long as the communicants are on the same plane of existence as you. You may end this effect early as an action."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "cha",
              "wis"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Pyschic Link",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "kalashtar"
            }
          ]
        }
      ],
      "entries": [
        "Being able to tap into other's psyche, you gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Impenetrable Mind.} You gain immunity to psychic damage.",
            "{@b Mind Meld.} Whenever a creature you can see within 30 feet of you is forced to make a Wisdom saving throw, you may use your reaction to give them advantage or disadvantage (your choice) on that roll. Once you use this feature, you cannot do so again until you finish a short or long rest."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "cha",
              "wis"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Kalashtar Mind Tricks",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "kalashtar"
            }
          ]
        }
      ],
      "entries": [
        "You are able to subtly influence others minds for your benefit. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Wave of the Hand.} When making a Charisma based skill check, you may choose to make the check with advantage. You must complete a long rest before you can use this ability again."
          ]
        }
      ],
      "ability": [
        {
          "cha": 1
        }
      ]
    },
    {
      "name": "Imitation Expert",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "kenku"
            }
          ]
        }
      ],
      "entries": [
        "You have learned to temporarily mimic even the training of others. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "Whenever another creature you can see uses a skill or tool, you can use your reaction to gain proficiency in that skill or tool. Proficiencies gained in this way last for 1 hour, and you can only mimic one proficiency at a time. Once you use this ability, you can't do so again until you finish a short or long rest."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "dex",
              "wis"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Master of Mimicry",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "kenku"
            }
          ]
        }
      ],
      "entries": [
        "Your imitation of others is uncanny and near perfect. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@ Voice Actor.} You have advantage on Charisma (Deception) checks when using your Mimicry trait. Additionally, any subsequent Charisma based skill checks using the same voice also have advantage."
          ]
        }
      ],
      "ability": [
        {
          "cha": 1
        }
      ]
    },
    {
      "name": "Shrouded Deceiver",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "kenku"
            }
          ]
        }
      ],
      "entries": [
        "You know how to manipulate sounds from the shadows to your advantage in combat. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@ Sound of Darkness.} You may take an Action on your turn to emit an unsettling or distracting sound of your choice. Any creature that can hear but not see you must make a Wisdom saving throw or suffer disadvantage on attack rolls and saving throws until the beginning of your next turn (the DC of which is calculated as 5 + your Charisma (Deception) modifier). Once you use this ability, you may not use it again until you take a short or long rest."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "dex",
              "cha"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Urd Wings",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "kobold"
            }
          ]
        }
      ],
      "entries": [
        "You manifest leathery wings, transforming into an urd. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "You gain a flying speed of 20 feet. To use this speed, you can't be wearing medium or heavy armor."
          ]
        }
      ]
    },
    {
      "name": "Inventor",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "kobold"
            }
          ]
        }
      ],
      "entries": [
        "Your natural creativity allows you to craft a variety of doo-dads and thinga-ma-bobs. Your creations last for 24 hours before they fall to pieces or otherwise become useless. When you complete a short rest, you can create one of the following inventions (it is assumed you can scavengewhat you need):",
        {
          "type": "list",
          "items": [
            "{@b Acid.} You create a small flask of acid which can be thrown at a foe. You are considered proficient with it and it has a range of 5/20 feet. If it hits a creature, it deals 2d6 acid damage to it.",
            "{@b Alchemist's Fire.} You concoct a small amount of highly volatile liquid. You are considered proficient with it and it has a range of 5/20 feet. If it hits a creature, it deals 1d4 fire damage to it and it takes 1d4 fire damage at the start of each of its turns. A creature may end this damage by using its action to make a DC 10 Dexterity check to extinguish the flames.",
            "{@b Basket of Centipedes.} You have gathered enough centipedes in a container to create a reasonable threat. You may throw the container of centipedes to a space within 20 feet. A swarm of insects (centipedes) with 11hit points emerges from the remnants of your containerand rolls initiative. At the end of each of the swarm's turns, there's a 50% chance it disperses.",
            "{@b Scorpion on a Stick.} You create a makeshift poison spear with a scorpion, spider, or other venomous insect tied tothe end. It is a melee weapon you are proficient with. If you hit a creature with it, it deals 1 damage + your Strength modifier and the target must make a DC 9 Constitution saving throw, taking 1d8 poison damage on a failed save, or half as much damage on a successful one.",
            "{@b Wasp Nest in a Bag.} You have gathered enough wasps in a container to create a reasonable threat. You may throw the container of wasps to a space within 20 feet. A swarm of insects (wasps) with 11 hit points emerges from the remnants of your container and rolls initiative. At the end of each of the swarm's turns, there's a 50% chance it disperses"
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "dex",
              "int"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Touch of Sess'inek",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "lizardfolk"
            }
          ]
        }
      ],
      "entries": [
        "You embody the demonic bearing of a lizard king or queen. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "You learn to speak, read, and write Abyssal.",
            "You are immune to being frightened."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "con",
              "wis"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Tanarukk Blood",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "orc"
            }
          ]
        }
      ],
      "entries": [
        "Through fell magic or an ancestor, you are touched by the corruptive power of Baphomet. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "You have resistance to fire and poison damage.",
            "You gain a bite attack as a natural weapon, which you can use to make unarmed strikes. If you hit with it, you deal piercing damage equal to {@dice 1d6} + your Strength modifier, instead of the bludgeoning damage normal for an unarmed strike."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "str",
              "con"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Feline Grace",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "tabaxi"
            }
          ]
        }
      ],
      "entries": [
        "Your incredible reflexes and agility further improve. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "You can use your Feline Agility trait twice before you must move 0 feet on one of your turns to use the trait again. You can still only use this ability once per turn when you move.",
            "You don't take damage from falling 20 feet or less if you aren't incapacitated."
          ]
        }
      ],
      "ability": [
        {
          "dex": 1
        }
      ]
    },
    {
      "name": "Tortle Protector",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "tortle"
            }
          ]
        }
      ],
      "entries": [
        "You have mastered using your shell to better protect yourself and others. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "Your natural armor trait now provides a base AC of 18. As normal, your Dexterity modifier doesn't affect this number.",
            "As a reaction when you are forced to make a Dexterity saving throw, choose any number of creatures within 5 feet of you. Each chosen creature is considered to have half-cover against any harmful attacks or effects while within 5 feet of you until the start of your next turn. Once you use this ability, you can't do so again until you've finished a short or long rest."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "str",
              "wis"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Triton Deep Magic",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "triton"
            }
          ]
        }
      ],
      "entries": [
        "You master more of the magic of elemental air and water. You learn the {@spell create or destroy water} spell and can cast it as a 1st level spell at will, without expending a spell slot. You also learn {@spell warding wind|phb} and {@spell water breathing}, each of which you can cast once without expending a spell slot. You regain the ability to cast those two spells in this way when you finish a long rest. Charisma is your spellcasting ability for all three spells."
      ]
    },
    {
      "name": "Serpent Form",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "yuan-ti pureblood"
            }
          ]
        }
      ],
      "entries": [
        "You have unlocked more of your serpentfolk heritage. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "You can use an action to polymorph into a Medium snake or back into your true form. Your statistics are the same in each form. Any equipment you are wearing or carrying isn't transformed. If you die, you stay in your current form",
            "While in snake form, you gain a bite attack as a natural weapon, which you can use to make unarmed strikes. If you hit with it, you deal piercing damage equal to {@dice 1d4} + your Strength modifier, instead of the bludgeoning damage normal for an unarmed strike. When you hit with a bite attack, you can choose to deal {@dice 2d6} additional poison damage to the target. Once you deal this poison damage, you can't do so again until you finish a long rest."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "int",
              "cha"
            ],
            "amount": 1
          }
        }
      ]
    }
  ]
}
