{
  "_meta": {
    "sources": [
      {
        "json": "RacialFeatsExpandedFedor",
        "abbreviation": "RFE",
        "full": "Racial Feats Expanded",
        "authors": [
          "Feodor Romanenkov"
        ],
        "convertedBy": [
          "Senort11"
        ],
        "version": "1.0.0",
        "url": "https://www.dmsguild.com/product/314753/Racial-Feats-Expanded",
        "targetSchema": "1.1.2"
      }
    ],
    "dateAdded": 1539373091,
    "dateLastModified": 1539373091
  },
  "feat": [
    {
      "name": "Sky Warden",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "aarakocra"
            }
          ]
        }
      ],
      "entries": [
        "You are trained for both scouting the skies and aerial combat. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "You gain proficiency in the Perception skill if you don't already have it. You add double your proficiency bonus to Perception checks that rely on sight.",
            "Once per turn, if you are flying and dive at least 30 feet straight toward a target and then hit it with a melee weapon attack, the attack deals an extra {@dice 1d6} damage to the target."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "dex",
              "wis"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Aerial Scout",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "aarakocra"
            }
          ]
        }
      ],
      "entries": [
        "Specializing in scouting in the skies, you gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Keen Senses.} You gain proficiency with the Perception skill if you're not already proficient. Additionally, You have advantage on Wisdom (Perception) checks that rely on hearing or sight.",
            "{@b Quick Glance.} You can use the Search action as a free action."
          ]
        }
      ],
      "ability": [
        {
          "dex": 1
        }
      ]
    },
    {
      "name": "Mastery of Air",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "aarakocra"
            }
          ]
        }
      ],
      "entries": [
        "Your time in the skies has given you not just an understanding of the flow of the winds, but some limited control of them. You learn the {@spell Gust|xge} cantrip and the {@spell Gust of Wind} spell. You may cast Gust of Wind without expending a spell slot or material components. Wisdom is your spellcasting ability for both spells. Once you have cast Gust of Wind with this feature, you must complete a short or long rest before you can use it again."
      ]
    },
    {
      "name": "Angelic Protection",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "aasimar"
            }
          ]
        }
      ],
      "entries": [
        "The innate resistance to magic that angels possess extends to you. You have advantage on saving throws against spells and other magical effects."
      ]
    },
    {
      "name": "Divine Recovery",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "aasimar"
            }
          ]
        }
      ],
      "entries": [
        "You learn to utilize divine healing to assist you and your party. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Divine Touch.} Your Healing Hands feature can be used as a bonus action.",
            "{@b Purifying Words} When you take an action (not bonus action) to use your Healing Hands feature, it gains a range of 30 feet.",
            "{@b Heavenly Influence.} Whenever a creature you can see regains Hit Points, you can use your reaction for them to regain additional Hit Points equal to your Charisma or Wisdom modifier, whichever is higher. You can use this feature once, and regain the ability to do so whenever you finish a short or long rest."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "cha",
              "wis"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Child of the Divine",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "aasimar (protector)"
            }
          ]
        }
      ],
      "entries": [
        "You learn to utilize divine healing to assist you and your party. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Divine Aid.} Whenever a creature within 30 feet of you (including yourself) fails a saving throw, you can use your reaction to have that creature roll again and use the new roll possibly turning a failure into a success. Once you use this feature, you cannot do so again until you finish a short or long rest."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "cha",
              "wis"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Radiant Warrior",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "aasimar (scourge)"
            }
          ]
        }
      ],
      "entries": [
        "You've become a divine warrior, comparable to the likes of a deva. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Angelic Strikes.} When you score a critical hit with amelee weapon attack, you can deal additional radiant damage equal to your Charisma modifier.",
            "{@b Radiant Smite.} You can cast the {@spell wrathful smite} spell once, without expending a spell slot. Once you do so, you cannot use this feature again until you finish a short or long rest. Charisma is your spellcasting ability for this spell."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "con",
              "cha"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Demi-Shaytan",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "aasimar (fallen)"
            }
          ]
        }
      ],
      "entries": [
        "Touched by evil influences, you gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Fiendish Strikes.} When you score a critical hit with a melee weapon attack, you deal additional necrotic damage equal to your Charisma modifier.",
            "{@b Life Drain.} You can use your {@i Healing Hands} on an enemy creature. The target must succeed on a Constitution saving throw (DC = 8 + your proficiency modifier + your Charisma modifier) or take necrotic damage equal to your level (half damage on a success). You regain Hit Points equal to the damage dealt."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "con",
              "cha"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Well-Rested",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "bugbear"
            }
          ]
        }
      ],
      "entries": [
        "Your practiced napping leaves you invigorated when you are awake. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "Whenever you spend one or more hit dice during a short rest, you can regain an extra {@dice 1d6} plus your Constitution modifier hit points.",
            "At the end of a long rest, you gain a d4 inspiration die which can be used on any ability check, attack roll, or saving throw. The die increases in size to a d6 at level 5, a d8 at level 10, and a d10 at level 15."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "dex",
              "str"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Child of Hruggek",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "bugbear"
            }
          ]
        }
      ],
      "entries": [
        "Blessed by the bugbear god of ambush, violence, and combat; you gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Heart of Hruggek.} You have advantage on saving throws against being charmed, frightened, paralyzed, poisoned, stunned, or put to sleep."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "dex",
              "str"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Brute",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "bugbear"
            }
          ]
        }
      ],
      "entries": [
        "You are good with your hands... well, at using them to kill things at least. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Heavy Blow.} Once per turn you can declare an attack to be a Heavy Blow. You can decalre this after an attack hits. The target creature takes an additional weapon damage equal to 1d4 plus half Strength modifier (rounded up) and must succeed in a Strength (Athletics) or Dexterity (Acrobatics) check against your attack roll or be knocked prone. You may use this feature a number of times equal to your Strength modifier (minimum of 1) before needing to complete a long rest to recharge all expended uses."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "dex",
              "str"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Equine Skirmisher",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "centaur"
            }
          ]
        }
      ],
      "entries": [
        "You've perfected the fighting style of Centaurs, gaining the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Skirmish.} If you move at least 15 feet in a straight line before making a melee attack, you make that melee attack with Advantage",
            "{@b Equine Form.} A Medium or smaller creature can ride onyour equine back if you allow it. In such a situation, you continue to act independently, not as a controlled mount."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "str",
              "wis"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Grand Galloper",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "centaur"
            }
          ]
        }
      ],
      "entries": [
        "Your legs grow even stronger from hard training or extended use, and you feel even faster than before. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Gallop.} You can Dash as a Bonus Action.",
            "{@b Equine Agility} If you take the Dash action on your turn, opportunity attacks against you are made with disadvantage.",
            "{@b Magical Hooves.} Your hooves now count as magical for the purposes of overcoming resistance."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "dex",
              "str"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Unicorn Magic",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "centaur"
            }
          ]
        }
      ],
      "entries": [
        "Your family is one of the few lucky enough to have a bloodline with a unicorn ancestor. Once dormant magic now courses through your veins, providing you with spellcasting typical of unicorns. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Unicorn Bloodline.} You can choose to grow a small unicorn horn on your forehead, or a larger horn if you already have one.",
            "{@b Fey Magic.} You learn the cantrip {@spell Druidcraft}, and the spells {@spell Entangle} and {@spell Shield of Faith}. You can cast each of these spells without expending a spell slot. Once you cast either of these spells in this way, you can't cast that spell in this way again until you finish a long rest. You can also cast these spells using spell slots you have of the appropriate level. The spells' spellcasting ability is the ability increased by this feat (Intelligence or Wisdom)."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "int",
              "wis"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Unsettling Visage",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "changeling"
            }
          ]
        }
      ],
      "entries": [
        "Being able to shapeshift at will, you are able to subtly change before an enemy, unsettling them. You gain the following benefits: ",
        {
          "type": "list",
          "items": [
            "When a creature you can see makes an attack roll against you, you can use your reaction to impose disadvantage on the roll. You must use this feature before knowing whether the attack hits or misses. Using this trait reveals your shapeshifting nature to any creature within 30 feet that can see you. Once you use this trait, you can't use it again until you finish a short or long rest."
          ]
        }
      ],
      "ability": [
        {
          "cha": 1
        }
      ]
    },
    {
      "name": "Chameleon",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "changeling"
            }
          ]
        }
      ],
      "entries": [
        "Your shapechanging is so complex, that it is hard to see through it even by magical means. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Anti-magic Visage.} You have advantage on Saving Throw against spells from the Divination school of magic.",
            "{@b Unscryable.} You can cast the {@spell Nondetection} spell on yourself once without expending a spell slot or material components once. Once you cast the spell in this way, you can't cast the spell in this way again until you finish a long rest."
          ]
        }
      ],
      "ability": [
        {
          "cha": 1
        }
      ]
    },
    {
      "name": "Identity Thief",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "changeling"
            }
          ]
        }
      ],
      "entries": [
        "You have a natural facility to create, remember and steal all kind of identities. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Perfect Impersonation.} You can perfectly mimic other creatures you've met. When impersonating another creature, you gain advantage on Charisma (Deception and Persuasion) checks that involve that creature's identity.",
            "{@b Smooth Talker.} You gain proficiency in either Deception or Persuasion. If you already have proficiency in the selected skill, you gain expertise instead."
          ]
        }
      ],
      "ability": [
        {
          "cha": 1
        }
      ]
    },
    {
      "name": "Shaped Breath",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "dragonborn"
            }
          ]
        }
      ],
      "entries": [
        "You are one of the rare dragonborn who have learned to shape and condense their breath weapon before unleashing it. You can now use your breath weapon in the following ways: ",
        {
          "type": "list",
          "items": [
            "{@b Line} Your breath weapon can be exhaled in a line 5 feet wide and 30 feet long.",
            "{@b Cone} Your breath weapon can be exhaled in a 15 foot cone.",
            "{@b Burst} Your breath weapon can be exhaled as a ball of explosive energy. Choose a point in a 60 foot range and a flash of your breath's energy will streak there and explode with a 10 foot radius."
          ]
        }
      ]
    },
    {
      "name": "Breath of the Ancients",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "dragonborn"
            }
          ]
        }
      ],
      "entries": [
        "The blood of dragons runs purer in your veins than other dragon born. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Empowered Breath.} The damage dice for your Breath Weapon are now d8s.",
            "{@b Ancestral Breath.} You can spend a bonus action on your turn to call on the latent power of the ancient dragon blood in your veins. Your breath weapon becomes a Recharge (6) ability rather than having one use per short or long rest. After you use your dragon breath, roll {@dice 1d6} on the beginning of your next turn. On a 6, your breath weapon instantly recharges. Your breath weapon can continue to recharge in this way for 10 minutes. Once you've used your breath in this way, your Breath Weapon cannot be used again until you take a long rest."
          ]
        }
      ]
    },
    {
      "name": "Natural Artisan",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "dwarf, elf, gnome"
            }
          ]
        }
      ],
      "entries": [
        "Being a part of a race with some of the finest artisans in the world, you gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Right Tool for the Job.} You gain profieciency with two artisan's tools of your choice.",
            "{@b Tool Master.} Choose one artisan's tool of which you're proficient in. Your proficiency bonus is doubled for any ability check made with this tool."
          ]
        }
      ],
      "ability": [
        {
          "int": 1
        }
      ]
    },
    {
      "name": "Field Smithy",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "dwarf"
            }
          ]
        }
      ],
      "entries": [
        "Your ability as a black smith had led you to be able to affect armament even without the use of a workshop. You gain the following benefits: ",
        {
          "type": "list",
          "items": [
            "{@b Expert Smith.} You gain proficiency with Smith's tools if you don't already have it. If you do, instead gain expertise with Smith's tools.",
            "{@b Sharpened Weapons.} At the end of a long rest, you can improve one nonmagical weapon with your smithing abilities. The wielder of the improved weapon may reroll 1s on damage rolls until the next long rest.",
            "{@b Improved Armor.} At the end of a long rest, you can improve one nonmagical piece of armor or a shield with your smithing abilities. Light armor becomes even lighter increasing the wearers speed by 5 feet, medium armor no longer imposes disadvantage on stealth checks, heavy armor recieves +1 AC, and shields provide a +2 to Dexeterity Saving throws.",
            "{@b Magical Forge Master.} Upon reaching 6th level, you can use a magic item as a base for either Sharpened Weapons and Improved Armor but not both. Upon reaching 12th level you can use a magic item as a base for both features."
          ]
        }
      ]
    },
    {
      "name": "Disturbing the Peace",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "dwarf"
            }
          ]
        }
      ],
      "entries": [
        "You've spent a lot of your downtime in the taverns with the rest of your dwarven buddies. You live for a good drink, uproarious laughter and a nice, old fashioned bar fight. This attitude extends beyond the bars of the dwarves for better or worse. You gain the following benefits",
        {
          "type": "list",
          "items": [
            "{@b Blunt the Knives.} You are proficient with improvised weapons.",
            "{@b Smash the Forks.} While you are wielding a weapon that doesn't have the Heavy property, it gains the Thrown property (if it doesn't already have it) with a range of 20/60 ft.",
            "{@ Experience Bar Hopper} You have advantage on Intelligence (History) checks to recall information about taverns, inns, and breweries. You have advantage on Intelligence (Investigation) checks made to find taverns, inns, and breweries. Additionally, you gain a +2 to Constitution Saving Throws made against the effects of alcoholic intoxication."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "str",
              "con"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Duergar Work Ethic",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "dwarf (duergar)"
            }
          ]
        }
      ],
      "entries": [
        "Endless work and toil is the Duergar way of life. You can continue onward, ignoring the aches and pains of your tired body until you cannot go on. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Tireless.} You suffer no penalities from the first and second level of exhuastion. Upon reaching the third level of exhuastion or higher, you now suffer from level 1 and 2 exhuastion effects.",
            "{@b Right Back to It.} You can spend a hit dice on a long rest to recover from an additional level of exhaustion."
          ]
        }
      ]
    },
    {
      "name": "Of the Seelie",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "elf (eladrin)"
            }
          ]
        }
      ],
      "entries": [
        "With your connection to the courts of the Feywild, you gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Improved Fey Step.} You can use your Fey Step feature twice before needing torest.",
            "{@b Short Seasons.} You can change your season during a short rest."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "cha",
              "int"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Aquatic Elf Magic",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "elf (sea)"
            }
          ]
        }
      ],
      "entries": [
        "You learn the magic of sea, from where you and your people come from. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Sea Magic.} You learn the {@spell shape water|xge} cantrip. You also learn the {@spell create or destroy water} and {@spell fog cloud} spells, each of which you can cast once without expending a spell slot. You regain the ability to cast these two spells in this way when you finish a long rest. Wisdom is your spellcasting ability for all three spells."
          ]
        }
      ]
    },
    {
      "name": "Raven's Gift",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "elf (shadar-kai)"
            }
          ]
        }
      ],
      "entries": [
        "Blessed by a deity of death, you gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Undying Devotee.} You have advantage on death saving throws.",
            "{@b Not Their Time.} You learn the {@spell Spare the Dying} cantrip."
          ]
        }
      ],
      "ability": [
        {
          "con": 1
        }
      ]
    },
    {
      "name": "Firbolg Beast Magic",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "firbolg"
            }
          ]
        }
      ],
      "entries": [
        "Your connection to animals deepens. You learn the {@spell speak with animals} spell and can cast it at will, without expending a spell slot. You also learn the {@spell animal friendship} and {@spell beast sense} spells, each of which you can cast once without expending a spell slot. You regain the ability to cast these two spells in this way when you finish a long rest. Wisdom is your spellcasting ability for all three spells."
      ]
    },
    {
      "name": "Firbolg Rage",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "firbolg"
            }
          ]
        }
      ],
      "entries": [
        "Your people are anything but confrontational, but when all else fails, a primal force awakens within you and destruction will be wrought at any cost. As a bonus action, you may enter a Firbolg Rage which lasts up to a minute, until you are unconscious, or until you end it on a subsequent turn as a bonus action. While in this state, you deal double the damage you normally would, but take double damage as well. When the effect ends, you gain 2 points of exhaustion and on your next long rest you must sleep for the duration losing the ability to partake in light activity (such as taking watch). Once you use this feature you may not do so again until you've completed a long rest."
      ]
    },
    {
      "name": "Steward of Nature",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "firbolg"
            }
          ]
        }
      ],
      "entries": [
        "You find that you are able to draw upon the strength of the land and its natural energies. The land grants you its power so that you may protect it. You learn the {@spell druidcraft} cantrip. When selecting this feat, you also learn one 1st level druid spell of your choice and one 2nd level druid spell of your choice. You always have these spells prepared and do not need to consume material components or spell slots to castthem. You may cast the 1st level spell two times before you must complete a long rest to recharge your uses of it. The 2nd level spell may only be cast once before you must complete a long rest to recharge its use. Wisdom is your spell casting modifer for this spell."
      ]
    },
    {
      "name": "Djinn Heritage",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "genasi (air)  "
            }
          ]
        }
      ],
      "entries": [
        "You manifest more of the magical power of your djinn heritage. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "You learn the {@spell detect magic} spell and can cast it only as a ritual.",
            "You have resistance to lightning and thunder damage."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "dex",
              "con"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Djinn Legacy",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "genasi (air)  "
            }
          ]
        }
      ],
      "entries": [
        "Your connection to the Elemental Plane of Air is heightened. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Lighter than Air.} You gain a flying speed of 15 feet. To use this speed, you cannot be wearing medium or heavy armor and you cannot be encumbered.",
            "{@b Strong Gust.} You learn the {@spell Gust|xge} cantrip if you don't already know it. Constitution is your spell casting ability for it. Additionally, whenever you push a creature with this spell, they get pushed 10 feet, rather than 5, and you can push them in any direction."
          ]
        }
      ],
      "ability": [
        {
          "dex": 1
        }
      ]
    },
    {
      "name": "Dao Heritage",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "genasi (earth)"
            }
          ]
        }
      ],
      "entries": [
        "You manifest more of the magical power of your dao heritage. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "You learn the {@spell detect magic} spell and can cast it only as a ritual.",
            "You gain natural armor. While you aren't wearing armor, you can calculate your AC as 13 + your Dexterity modifier. You can use a {@item shield} and still gain this benefit."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "str",
              "con"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Dao Legacy",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "genasi (earth)  "
            }
          ]
        }
      ],
      "entries": [
        "Your connection to the Elemental Plane of Earth is heightened. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Unarmored Defense.} When not wearing armor, your AC is calculated as 13 + your Constitution modifier. You can use a {@item shield} and still gain this benefit.",
            "{@b Earth Shaper.} You learn the {@spell mold earth|xge} cantrip if you don't already know it."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "str",
              "con"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Efreeti Heritage",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "genasi (fire) "
            }
          ]
        }
      ],
      "entries": [
        "You manifest more of the magical power of your efreeti heritage. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "You learn the {@spell detect magic} spell and can cast it only as a ritual.",
            "Your darkvision has a radius of 120 feet."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "con",
              "int"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Efreeti Legacy",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "genasi (fire)  "
            }
          ]
        }
      ],
      "entries": [
        "Your connection to the Elemental Plane of Fire is heightened. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Elemental Fire.} You can cast the {@spell flame blade} and {@spell scorching ray} spells each without expending a spell slot. Once you cast a spell this way, you cannot do so again until you finish a long rest. Intelligence is your spellcasting ability for these spells.",
            "{@b Natural Heat.} Due to your radiating heat, you gain resistance to cold damage."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "con",
              "int"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Marid Heritage",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "genasi (water)"
            }
          ]
        }
      ],
      "entries": [
        "You manifest more of the magical power of your marid heritage. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "You learn the {@spell detect magic} spell and can cast it only as a ritual.",
            "You have resistance to cold damage."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "con",
              "wis"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Marid Legacy",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "genasi (water)  "
            }
          ]
        }
      ],
      "entries": [
        "Your connection to the Elemental Plane of Water is heightened. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Watery Core.} You gain advantage on saving throws for effects that deal fire damage.",
            "{@b Water Cannon.} You can use your action to shoot water in a 30-foot line that is 5 feet wide. Each creature in that line must make a Dexterity saving throw (DC = 8 + your proficiency modifier + your Constitution modifier). On a failure, a target takes {@dice 2d8} bludgeoning damage and, if it is Huge or smaller, is pushed up to 10 feet away from you and knocked prone. On a success, a target takes half the bludgeoning damage, but is neither pushed nor knocked prone."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "con",
              "wis"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Draw Element",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "genasi"
            }
          ]
        }
      ],
      "entries": [
        "By focusing your energies, you are able to enhance your elemental powers. Depending on your subrace, you gain one of the following abilities as detailed on the Draw Element Table below. After using one of these features, you must finish a long rest before using that feature again.",
        {
          "type": "table",
          "caption": "Draw Element Table",
          "colLabels": [
            "Genasi Subrace",
            "Ability"
          ],
          "colStyles": [
            "col-4 text-center",
            "col-8 text-center "
          ],
          "rows": [
            [
              "{@b Air.}",
              "As a bonus action, you lighten your step with a touch of wind. Your speed is doubled until the end of your turn."
            ],
            [
              "{@b Earth.}",
              "As a reaction when you would take damage, your body hardens to protect you. You gain resistance to all damage types except psychic until the start of your next turn."
            ],
            [
              "{@b Fire.}",
              "As a bonus action, you hone your attention on your task much like a flame is focused to a white hot point. Your proficiency bonus is tripled for one skill of your choice for the next 1 minute."
            ],
            [
              "{@b Water.}",
              "As a bonus action, you are able to center yourself to prepare for your next strike. You gain advantage on attack rolls you make this turn."
            ]
          ]
        }
      ],
      "ability": [
        {
          "con": 1
        }
      ]
    },
    {
      "name": "Psi Disciple",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "Gith"
            }
          ]
        }
      ],
      "entries": [
        "Your psionic training is more advanced than most Gith. Choose one cantrip from the Sorcerer spell list. Additionally, choose two 1st-leveled spells from the Sorcerer spell list. You can cast each of the cantrip and spells as part of your Psionics trait. Once you cast either spell this way, you cannot do so again until you finish a long rest. Intelligence is your spellcasting ability for these spells."
      ]
    },
    {
      "name": "Silver Sword Adept",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "Gith (Githyanki)"
            }
          ]
        }
      ],
      "entries": [
        "You learned to respect a silver sword as a priceless relic and a work of art. You have learned how to channel the force of your will with one of these relics in your hands.",
        {
          "type": "list",
          "items": [
            "{@b Githyanki Sword Training.} You gain proficiency with greatswords, shortswords, longswords, and rapiers.",
            "{@b Silvered Expertise.} When using a silvered weapon, add +1 to both attack and damage rolls."
          ]
        }
      ],
      "ability": [
        {
          "str": 1
        }
      ]
    },
    {
      "name": "Zerth Adept",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "Gith (Githzerai)"
            }
          ]
        }
      ],
      "entries": [
        "You have full knowledge of the Unbroken Circles of Zerthimon, and followed all his teaching and principles with discipline. Your senses are enhanced and you gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Githzerai Blindfold Training.} You have blindsight, perceiving your surrounding without relying on sight, within a radius of 20 feet.",
            "{@b Heightened Senses} You gain proficiency in Wisdom (Perception) skill checks."
          ]
        }
      ],
      "ability": [
        {
          "dex": 1
        }
      ]
    },
    {
      "name": "Psionic Combat Training",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "Gith"
            }
          ]
        }
      ],
      "entries": [
        "You have recieved avdvanced training in psionic abilities. You gain the following benefits.",
        {
          "type": "list",
          "items": [
            "{@b Psi Warrior.} As a bonus action on your turn, you can imbue your weapons with psionic force. For 1 minute, the first attack on each turn deals an additional 1d4 + Proficiency Bonus psychic damage.",
            "{@b Blurring Reality}. You learn the {@spell blur} spell. You can cast this spell as part of your Psionics trait. You regain the ability to do so after a long rest."
          ]
        }
      ],
      "ability": [
        {
          "str": 1
        }
      ]
    },
    {
      "name": "Tree Hopper",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "gnome (forest)"
            }
          ]
        }
      ],
      "entries": [
        "You have spent most of your life in the forest. Moving around amongst the trees is second nature to you. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "You may use your action to climb a tree and move from it to another tree within 50 feet. Both trees must be living and at least the same size as you. You must use 5 feet of movement to enter a tree. You appear in a spot of your choice within 5 feet of the destination tree. You can use this transportation ability twice, regaining expended uses on a short or long rest."
          ]
        }
      ]
    },
    {
      "name": "Gnomish Transformation",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "gnome"
            }
          ]
        }
      ],
      "entries": [
        "You may use your action to transform into the shape of a mushroom, a small shrub or a bright wooden figurine of a gnome. While in this form you cannot speak or perform any actions, and your speed becomes 0. You are considered Heavily Obscured while in natural terrain and in this form. In non-natural terrian (cities, man-made dungeons etc) you instead have advantage on Stealth checks. You can end this effect as a bonus action."
      ]
    },
    {
      "name": "Gnomish Engineering",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "gnome (rock)"
            }
          ]
        }
      ],
      "entries": [
        "Your tinkered gnomish inventions go beyond their usual capabilites.",
        {
          "type": "list",
          "items": [
            "{@b Clockwork Bomb. } When you construct a Clockwork Toy, you can rig it to explode. As a bonus action, you can set off one of these explosive devices which deal 1d4 fire damage in a 5 foot radius. Addtionally, your mastery of engineering allows you to precisely control the movement of your clockwork toys. As a bonus action, you can direct any and all clockwork toys to move 5 feet in any direction.",
            "{@b Fire Breather. } Your fire starter's flames last indefinitely. While activated, it sheds bright light in a 10 foot radius and dim light for additional 10 feet. Additionally, flames set by your fire starters never extinguish due to running out fuel. They can still be extinguished by other conventional means (patting them out, water, etc).",
            "{@b Lullaby. } You can set up your music boxes to play very effective lullabys. If you choose to do so when creating a music box, any creature who listens to the entirety of the song played by one of your music boxes must succeed a DC 12 Wisdom saving throw or fall asleep."
          ]
        }
      ]
    },
    {
      "name": "Like a Boss",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "goblin"
            }
          ]
        }
      ],
      "entries": [
        "You are accustomed to using others as a distraction to avoid being attacked. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Goblin Tactics.} When a creature you can see targets you with an attack and another creature is within 5 feet of you, you can use your reaction to impose disadvantage on the attack roll. Once you use this ability, you can't do so again until you finish a short or long rest."
          ]
        }
      ],
      "ability": [
        {
          "dex": 1
        }
      ]
    },
    {
      "name": "Malicious Tactics",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "goblin"
            }
          ]
        }
      ],
      "entries": [
        "You are accustomed to using others as a shield to avoid being attacked. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Goblin Manuevering.} When a creature you can see targets you with an attack, you can use your reaction to choose another creature within 5 feet of it. You and that creature swap places, and the chosen creature becomes the target instead. You can use this feature a number of times equal to your proficiency modifier divided by 2 rounded down (minimum of 1 use), and regain all uses whenever you finish a long rest."
          ]
        }
      ]
    },
    {
      "name": "Chaos Reveler",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "goblin"
            }
          ]
        }
      ],
      "entries": [
        "Your fighting style has developed in the madness and chaos of all-out goblin war. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Goblin Frenzy.} For each creature you deal damage to beyond the first with melee weapon attacks, you deal {@dice 1d6} additional damage to it (the 2nd creature you damage takes {@dice 1d6} extra, the third takes {@dice 2d6} extra etc.)."
          ]
        }
      ],
      "ability": [
        {
          "dex": 1
        }
      ]
    },
    {
      "name": "Mountain's Endurance",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "goliath"
            }
          ]
        }
      ],
      "entries": [
        "Your ability to shrug off grave injuries is legendary, even for a Goliath. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "When you use your Stone's Endurance trait as a reaction to reduce damage, instead of rolling a d12 and adding your Constitution modifier, you can choose to gain resistance to the triggering attack's damage type until the start of your next turn. If the triggering attack deals more than one type of damage, choose one. As normal, after you use this trait, you can't use it again until you finish a short or long rest."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "str",
              "con"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Self-Competition",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "goliath"
            }
          ]
        }
      ],
      "entries": [
        "Your greatest competitor is yourself, constantly looking to grow even in the heat of combat. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b You Can Do Better.} Whenever you make two weapon attacks in a row (not necessarily on the same turn), you can choose to roll {@dice 1d4} and add it to the damage roll of the second attack. If the second damage roll including the additional d4 doubles the total of the first damage roll (do not include modifiers or extra damage dice from other features such as Sneak Attack or Divine Smite. Damage from critical hits count however), this ability instantly recharges and the addtional damage die increases by one size. You can chain together multiple uses of this ability assuming you keep doubling damage. Once you use this feature, you cannot do so again until you finish a long rest. When completing a long rest, the damage die returns the original size of a d4.",
            "Die increases follow this pattern d4 > d6 > d8 > d12 > 2d8 > 2d12 > 3d8 > 3d12 > etc"
          ]
        }
      ]
    },
    {
      "name": "Giant's Strength",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "goliath"
            }
          ]
        }
      ],
      "entries": [
        "The mighty blood of giants runs through your veins. Your might shines through when you swing mighty weapons. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Overwhelming Strength.} When you make a melee attack with a Heavy weapon, you add additional weapon damage equal to half your Strength modifier rounded up."
          ]
        }
      ],
      "ability": [
        {
          "str": 1
        }
      ]
    },
    {
      "name": "Improved Lightfoot Stealth",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "halfling (lightfoot)"
            }
          ]
        }
      ],
      "entries": [
        "You can slip away from sight with ease in crowds whether that's a crowd of gnomes or goliaths. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Disappearing Act.} You can attempt to hide even when you are only partially obscured by a creature that is your size or larger.",
            "{@b Improved Stealth.} You gain advantage on Dexterity (Stealth) rolls when you are partially or fully obscured."
          ]
        }
      ]
    },
    {
      "name": "Improved Stout Toughness",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "halfling (stout)"
            }
          ]
        }
      ],
      "entries": [
        "Your ability to shrug off poison and infection is great even among stout halflings. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Strong Immune Response.} You have advantage on saving throws against poison and disease, and you have resistance to poison damage and damaging symptoms of diseases.",
            "{@b Built Tough.} You gain half proficiency in Constitution Saving Throws. If you are already proficient, then add an additional half your proficiency bonus rounded down to your Constitution Saving Throws."
          ]
        }
      ]
    },
    {
      "name": "Adventuring Spirit",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "halfling"
            }
          ]
        }
      ],
      "entries": [
        "You can't resist the call to adventure and you've been on a few in your time. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Good Eye.} You have advantage on Wisdom (Perception) and Intelligence (Investigation) made to detect the presence of secret doors.",
            "{@b Better Reactions.} You have advantage on saving throws to avoid traps.",
            "{@b Eager Adventurer} Your brash eagerness to take on quests that will take you to new places is endearing to those who ask for your help. You have advantage on Wisdom (Insight) and Charisma (Persuasion) checks when trying to gather information from people who have given you a task about said task."
          ]
        }
      ]
    },
    {
      "name": "Strong Elven Blood",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "Half Elf"
            }
          ]
        }
      ],
      "entries": [
        "The elven blood that flows through your veins is potent. Your elvish characterstics are so prominent that some laymen might even mistake you for an elf. You gain the following benefit:",
        {
          "type": "list",
          "items": [
            "{@b Ancestral Blood.} Choose one racial trait from the race of Elves you descend from. You now have that racial trait as well."
          ]
        }
      ]
    },
    {
      "name": "Brutish Skill",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "half-orc"
            }
          ]
        }
      ],
      "entries": [
        "The mix of your human ingenuity and savage orc strength makes even your glancing blows hurt like hell. You gain the following benefit:",
        {
          "type": "list",
          "items": [
            "{@b Unrefined Prowess.} When you roll a natural 1 on an attack roll with a weapon, you can reroll that attack and must use the new roll. You can use this feature a number of times equal to your proficiency bonus."
          ]
        }
      ]
    },
    {
      "name": "Uphold the Legion",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "hobgoblin"
            }
          ]
        }
      ],
      "entries": [
        "You were born for life in the legion. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "You can deal an extra {@dice 2d6} damage to a creature you hit with a weapon attack if that creature is within 5 feet of an ally that isn't incapacitated. You can use this trait only once per combat.",
            "You can extend the benefit of your Saving Face trait to an ally. As a reaction, if an ally misses with an attack roll or fails an ability check or a saving throw, you can grant a bonus to the roll equal to the number of allies your ally can see within 30 feet (including you, maximum bonus of +5). As normal, once you use this trait, you can't use it again until you finish a short or long rest."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "con",
              "int"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Line Commander",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "hobgoblin"
            }
          ]
        }
      ],
      "entries": [
        "You learned to lead front line troops experty. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Frontline Tactics.} When you are within 5 feet of an ally of your choice, both you and your ally gain +2 to attack rolls. This benefit extends to all allies on the straight line formed by you and your selected ally (think shieldwall).",
            "{@b No Openings.} Whenever you or an ally who are recieving the Frontline Tactics benefit gets hit with a melee attack, all allies within 5 feet that have the Frontline Tactics benefit may use their reaction to make an opportunity attack."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "con",
              "int"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Natural Leadership",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "hobgoblin"
            }
          ]
        }
      ],
      "entries": [
        "As a hobgoblin you are familiar with the art of war and have an innate understanding of leading troops in batte. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Commanding Officer.} As an action, you may have a single ally within 60 feet take the dodge action, disengage action, attack action, or move up to their movement speed. Until the beginning of your next turn, you gain +2 AC."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "cha",
              "wis"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Short Lived",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "human"
            }
          ]
        }
      ],
      "entries": [
        "The life of a human is nasty, brutish, and short but you'll be damned if you don't make your mark. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Heroic Sacrifice.} If you are dropped down to 0 hitpoints, you may immediately take a turn. All attack rolls that hit become critical hits and any damage done by a spell requiring a saving throw is doubled. At the end of your turn, you fall unconscious, fail two death saving throws automatically, and must immediately make a death saving throw with disadvantage. This ability cannot be used again.",
            "{@b Heroic Triumph.} If you survive making a Heroic Sacrifice, you immediately recieve an Ability Score Improvement and feat of your choice."
          ]
        }
      ]
    },
    {
      "name": "Party Link",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "kalashtar"
            }
          ]
        }
      ],
      "entries": [
        "You are able to bridge the psychic gap between other beings minds. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Hive Mind Communication.} Your Mind Link capabilities extend further through your connection to the plane of dreams. Each long rest, you may designate up to a number of willing creatures other than yourself become part of a telepathic Hive Mind. You are automatically a part of the Hive Mind and the maximum number of creatures you can designate is equal to you proficiency bonus. Each of those creatures can communicate telepathically with each other and you as long as they remain within a number of feet equal to 10 times your character level from at least one other creature who is part of the Hive Mind. You may end this effect early as an action."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "cha",
              "wis"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Pyschic Link",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "kalashtar"
            }
          ]
        }
      ],
      "entries": [
        "Being able to tap into other's psyche, you gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Impenetrable Mind.} You gain immunity to psychic damage.",
            "{@b Mind Meld.} Whenever a creature you can see within 30 feet of you is forced to make a Wisdom saving throw, you may use your reaction to give them advantage or disadvantage (your choice) on that roll. Once you use this feature, you cannot do so again until you finish a short or long rest."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "cha",
              "wis"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Kalashtar Mind Tricks",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "kalashtar"
            }
          ]
        }
      ],
      "entries": [
        "You are able to subtly influence others minds for your benefit. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Wave of the Hand.} When making a Charisma based skill check, you may choose to make the check with advantage. You must complete a long rest before you can use this ability again."
          ]
        }
      ],
      "ability": [
        {
          "cha": 1
        }
      ]
    },
    {
      "name": "Imitation Expert",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "kenku"
            }
          ]
        }
      ],
      "entries": [
        "You have learned to temporarily mimic even the training of others. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "Whenever another creature you can see uses a skill or tool, you can use your reaction to gain proficiency in that skill or tool. Proficiencies gained in this way last for a number of hours equal to half your proficiency bonus rounded down, and you can only mimic one proficiency at a time."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "dex",
              "wis"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Master of Mimicry",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "kenku"
            }
          ]
        }
      ],
      "entries": [
        "Your imitation of others is uncanny and near perfect. You gain the following benefits: ",
        {
          "type": "list",
          "items": [
            "{@b Voice Actor.} You have advantage on Charisma (Deception) checks when using your Mimicry trait to convince a creature that you are the person you're mimicing. Additionally if you manage to convince the creature you are this other person, any subsequent Charisma based skill checks using the same voice also have advantage."
          ]
        }
      ],
      "ability": [
        {
          "cha": 1
        }
      ]
    },
    {
      "name": "Shrouded Deceiver",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "kenku"
            }
          ]
        }
      ],
      "entries": [
        "You know how to manipulate sounds from the shadows to your advantage in combat. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Sound of Darkness.} You may take an Action on your turn to emit an unsettling or distracting sound of your choice. Any creature that can hear but not see you must make a Wisdom saving throw or suffer disadvantage on attack rolls and saving throws until the beginning of your next turn (the DC of which is calculated as 5 + your Charisma (Deception) modifier). Once you use this ability, you may not use it again until you take a short or long rest."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "dex",
              "cha"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Urd Wings",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "kobold"
            }
          ]
        }
      ],
      "entries": [
        "You manifest leathery wings, transforming into an urd. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "You gain a flying speed of 20 feet. To use this speed, you can't be wearing medium or heavy armor."
          ]
        }
      ]
    },
    {
      "name": "Inventor",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "kobold"
            }
          ]
        }
      ],
      "entries": [
        "Your natural creativity allows you to craft a variety of doo-dads and thinga-ma-bobs. Your creations last for 24 hours before they fall to pieces or otherwise become useless. When you complete a short rest, you can create one of the following inventions (it is assumed you can scavengewhat you need):",
        {
          "type": "list",
          "items": [
            "{@b Acid.} You create a small flask of acid which can be thrown at a foe. You are considered proficient with it and it has a range of 5/20 feet. If it hits a creature, it deals 2d6 acid damage to it.",
            "{@b Alchemist's Fire.} You concoct a small amount of highly volatile liquid. You are considered proficient with it and it has a range of 5/20 feet. If it hits a creature, it deals 1d4 fire damage to it and it takes 1d4 fire damage at the start of each of its turns. A creature may end this damage by using its action to make a DC 10 Dexterity check to extinguish the flames.",
            "{@b Basket of Centipedes.} You have gathered enough centipedes in a container to create a reasonable threat. You may throw the container of centipedes to a space within 20 feet. A swarm of insects (centipedes) with 11hit points emerges from the remnants of your containerand rolls initiative. At the end of each of the swarm's turns, there's a 50% chance it disperses.",
            "{@b Scorpion on a Stick.} You create a makeshift poison spear with a scorpion, spider, or other venomous insect tied tothe end. It is a melee weapon you are proficient with. If you hit a creature with it, it deals 1 damage + your Strength modifier and the target must make a DC 9 Constitution saving throw, taking 1d8 poison damage on a failed save, or half as much damage on a successful one.",
            "{@b Wasp Nest in a Bag.} You have gathered enough wasps in a container to create a reasonable threat. You may throw the container of wasps to a space within 20 feet. A swarm of insects (wasps) with 11 hit points emerges from the remnants of your container and rolls initiative. At the end of each of the swarm's turns, there's a 50% chance it disperses"
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "dex",
              "int"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Trap Knowledge",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "kobold"
            }
          ]
        }
      ],
      "entries": [
        "Unlike many of the other monstrous races, your kind isclever and has an understanding of how complex machinery works. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Kobold Trapper.} You have advantage on any ability check to identify, locate, or understand traps. You instantly find and understand any trap made by kobolds.",
            "{@b Trap Evasion.} If a trap forces you to make a saving throw to avoid damage, you take 1/2 damage on a failed saving throw and no damage on a successful saving throw."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "int",
              "wis"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Touch of Sess'inek",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "lizardfolk"
            }
          ]
        }
      ],
      "entries": [
        "You embody the demonic bearing of a lizard king or queen. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "You learn to speak, read, and write Abyssal.",
            "You are immune to being frightened."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "con",
              "wis"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Reptilian Hunter",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "lizardfolk"
            }
          ]
        }
      ],
      "entries": [
        "Your kind is suited to hunting. Finding your prey is a simple task for you and, you are unlikely to let it escape. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Expert Tracking.} You have advantage on Wisdom (Perception) checks to locate beasts and on Wisdom (Survival) checks to follow its tracks.",
            "{@b Marked for Dinner.} You learn the spell {@spell Hunter's Mark} and can cast it as a level 1 spell without expending a spell slot. When you case the spell in this way, you cannot do so again until you complete a short or long rest."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "str",
              "wis"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Cold Blooded Predator",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "lizardfolk"
            }
          ]
        }
      ],
      "entries": [
        "You have embraced the primal predator within you. You follow the bestial and savage path of your ancient ancestors. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Apex Predator.} Instead of choosing two abilities to gain proficiency in for your Hunter's Lore feature, you gain proficiency in all of the listed skills.",
            "{@b Ferocious Bite.} Your Bite ability deals {@dice 2d6} + your Strength modifier when you reach 8th level and {@dice 3d6} + your Strength modifier when you reach 15th level.",
            "{@b Primal Hunger.} Instead of only being to use Hungry Jaws once per short or long rest, you can now use it a number of times equal to your proficiency modifier divided by 2 rounded down."
          ]
        }
      ]
    },
    {
      "name": "Bolstering Magic",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "leonin"
            }
          ]
        }
      ],
      "entries": [
        "For the sake of the pride some Leonin learn magic to empower and protect others. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "You know the {@spell guidance} cantrip. When you reach 3rd level, you can cast the {@spell bless} spell as a 2nd-level spell once with this trait and regain the ability to do so when you finish a long rest. When you reach 5th level, you can cast the {@spell magic weapon} spell once with this trait and regain the ability to do so when you finish a long rest."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "str",
              "con"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Revenant Blade",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "leonin"
            }
          ]
        }
      ],
      "entries": [
        "You are descended from a master of the double-bladed scimitar, and some of that mastery has passed on to you. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "While you are holding a double-bladed scimitar with two hands, you gain a +1 bonus to Armor Class.",
            "A double-bladed scimitar has the finesse property when you wield it."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "str",
              "dex"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "King of the Jungle",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "leonin"
            }
          ]
        }
      ],
      "entries": [
        "Leonin are fierce warriors. Some have such a reputation for ferocity that their roars instill fear in their opponents. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Ferocious Roar} Using an action you may release a deafening roar. Any hostile creature that can hear you within 60 feet must make a Wisdom Saving Throw or be frightened until the end of their next turn. While frightened in this way, the creature cannot take reactions, and on its turn it can only take the dash action must end its turn at least 60 feet away from you. If for some reason it is unable to end its turn this far away (such as being in enclosed space) they take 1d6 psychic damage for every full 15 feet they still needed to move (minimum 1d6). The DC for this ability is 8 + your proficiency bonus + your Charisma modifier. Once you use this ability, you cannot do so again until you complete a long rest."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "con",
              "cha"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Tusker",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "loxodan"
            }
          ]
        }
      ],
      "entries": [
        "You've learned to use your tusks as a dangerous weapon, gaining the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Tusk Weapon.} Your tusks become natural weapons. When you attack with your tusks, you deal piercing damage equal to 1d6 + your Strength modifier.",
            "{@b Thick Hide.} Your Natural Armor is now calculated as 13 + your Constitution modifier."
          ]
        }
      ]
    },
    {
      "name": "War Elephant",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "loxodan"
            }
          ]
        }
      ],
      "entries": [
        "You've learned that peace and tranquility isn't always an option. You are a Loxodan Warrior trained in the art of war. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Battle Charge.} Whenever you move at least 20ft straight toward a target you may make a goring attack with your tusks as a bonus action dealing {@dice 1d6} piercing + your Strength modifier. If it hits and the target fails a Dexterity (Acrobatics) or a Strength (Athletics) Saving Throw (the DC of which is calculated as 8 + your proficiency bonus + your Strength modifier) it is knocked prone.",
            "{@b Strong Trunk.} When using your trunk to make an unarmed strike, you deal {@dice 1d4} + your Strength modifier damage instead of the normal unarmed strike damage. Additionally, you gain profiency with Strength (Athletics) checks when using your trunk to grapple. If you already have proficiency in Athletics, then you gain expertise instead. Further still, your trunk can now lift a number of pounds equal to 10 times your Strength score."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "str",
              "wis"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Mindful Fortitude",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "loxodan"
            }
          ]
        }
      ],
      "entries": [
        "You've spent long hours in solitude meditating. Your body and mind are in perfect sync affording you incredible health and fortitude. You gain the following benefits::",
        {
          "type": "list",
          "items": [
            "{@b Mind-Body Connection.} You may add half of your Wisdom modifier rounded down to your maximum health when you gain a level. This effect is retroactively applied to all levels you have gained so far.",
            "{@b Strong of Spirit and Flesh.} When you are forced to make a Wisdom or Constitution saving throw but before being told whether or not you made the save, you may use your reaction to expend 1 of your hit dice and add the value rolled to your saving throw."
          ]
        }
      ]
    },
    {
      "name": "Warcaller",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "minotaur"
            }
          ]
        }
      ],
      "entries": [
        "Honing your natural talents as a Minotaur, you gain thefollowing benefits. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Labyrinthine Recall.} You gain proficiency in the History skill if you're not proficient already (if you are, gain expertise instead), and you can perfectly recall any path you have traveled.",
            "{@b Deathbellow.} You release a bellowing roar that terrifies the feeble-minded. As a bonus action, each creature of your choice within 15 feet of you that can hear you must succeed on a Wisdom saving throw (DC = 8 + your proficiency bonus + your Constitution modifier) or take psychic damage equal to your Constitution modifier and become frightened of you for until the start of your next turn. Creatures that succeed this saving throw still take damage but do not become frightened. Once you use this feature, you cannot do so again until you finish a long rest."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "str",
              "con"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Battle Horns",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "minotaur"
            }
          ]
        }
      ],
      "entries": [
        "You've honed your ability to use your ferocious horns in battle. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Critical Gore.} When making an attack roll with your horns, you critically hit on a 19 or 20.",
            "{@b Deep Wounds.} On a critical hit with your horns, the targe must make a Constitution saving throw at the end of each of its following turns or the creature takes necrotic damage equal to your level + your proficiency bonus. The DC for this save is 10 + your Consistution modifier. The condition ends after 3 successful saves or 1 minute.",
            "{@b Blood Lust} Whenever you reduce a creature to 0 hitpoints or you land a critical strike against a creature, you may add additional damage equal your Strength bonus to all damage rolls you make thereafter until the end of your next turn."
          ]
        }
      ]
    },
    {
      "name": "Resident of the Underdark",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "minotaur"
            }
          ]
        }
      ],
      "entries": [
        "Your ancestors lived far underground in labyrinthine mazes devoid of light. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Darkvision.} You can see in dim light within 30 feet of you as if it were bright light, and in Darkness as if it were dim light. You can't discern color in Darkness, only Shades of Gray.",
            "{@b Molded by Darkness.} You have advantage on any checks made to navigate dark, underground spaces."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "con",
              "wis"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Tanarukk Blood",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "orc"
            }
          ]
        }
      ],
      "entries": [
        "Through fell magic or an ancestor, you are touched by the corruptive power of an Arch Demon. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "You have resistance to fire and poison damage.",
            "You gain a bite attack as a natural weapon that uses your Strength modifier. If you hit with it, you deal piercing damage equal to {@dice 1d6} + your Strength modifier."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "str",
              "con"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Hand of Gruumsh",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "orc"
            }
          ]
        }
      ],
      "entries": [
        "Born for battle, you gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Relentless Endurance.} When you are reduced to 0 hitpoints but not killed outright, you can drop to 1 hit point instead. You can't use this feature again until you finish along rest.",
            "{@b Savage Attacks.} When you score a critical hit with a melee weapon attack, you can roll one of the weapon's damage dice one additional time and add it to the extra damage of the critical hit."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "str",
              "con"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Raw Orcish Aggression",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "orc"
            }
          ]
        }
      ],
      "entries": [
        "Born for battle, you gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Orc Rage.} You can spend a bonus action on your turn to Rage which follows the same rules as Barbarian Rage and gains benefits from levels in the Barbarian class. When you enter a Rage using this ability, you suffer a level of exhaustion when the Rage ends.",
            "{@b Aggressive Charge.} When you use your Aggressive racial trait and move at least 20 feet in a straight line on your turn, you may make a melee weapon attack against a target within your reach or attempt to shove an enemy creature within 5 feet of you. Additionally, when you use your bonus action to dash using the Aggressive trait, you gain additional movement equal to your speed plus 10 feet."
          ]
        }
      ]
    },
    {
      "name": "Party Magic",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "satyr"
            }
          ]
        }
      ],
      "entries": [
        "You have learned the perfect magic to get others to join the party. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Party Spells.} You know the {@spell friends} cantrip. When you reach 3rd level, you can cast the {@spell charm person} spell as a 2nd-level spell once with this trait and regain the ability to do so when you finish a long rest. When you reach 5th level, you can cast the {@spell suggestion} spell once with this trait and regain the ability to do so when you finish a long rest. Charisma is your spellcasting ability for these spells."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "cha",
              "dex"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Party Magic",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "satyr"
            }
          ]
        }
      ],
      "entries": [
        "You have learned the perfect magic to get others to join the party. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Party Spells.} You know the {@spell friends} cantrip. When you reach 3rd level, you can cast the {@spell charm person} spell as a 2nd-level spell once with this trait and regain the ability to do so when you finish a long rest. When you reach 5th level, you can cast the {@spell suggestion} spell once with this trait and regain the ability to do so when you finish a long rest. Charisma is your spellcasting ability for these spells."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "cha",
              "dex"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Fey Warrior",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "satyr"
            }
          ]
        }
      ],
      "entries": [
        "Revelry is better when you have more to join! It also leaves them distracted. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Charming Strike.} When you hit with an attack roll, you can have the target roll a Wisdom Saving Throw versus a DC equal to 8 + your proficiency bonus + your Charisma modifier. On a failure, the target is so impressed by your prowess they become charmed by you until the end of your next turn. Once you use this feature, you cannot do so again until you finish a long rest.",
            "{@b Hedonistic Strike.} When you make an weapon attack roll against a creature charmed by you, you can choose to make it a Hedonistic Strike. When you do so, the attack roll is made with advantage. If the attack hits, you can roll 1 additional damage die of the weapon used in the strike. Regardless of hitting or missing, the charm effect immedietely ends after using this feature."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "cha",
              "dex"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Performer at Heart",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "satyr"
            }
          ]
        }
      ],
      "entries": [
        "Satyrs are natural musicians and performers but you stand a head above the others. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Expert Performer.} You gain expertise in the Performance skill.",
            "{@b Art Student.} You have advantage on Intelligence (History) checks to recall information related to the arts.",
            "{@b Theatre Kid.} You learn the spell {@spell disguise self}. You can cast this spell at will."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "cha"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "One With the Pack",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "shifter"
            }
          ]
        }
      ],
      "entries": [
        "Becoming more animalistic, you gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Pack Tactics.} While shifted, you have advantage on attack rolls as long as the creature you're attacking is within 5 feet of an ally and the ally isn't incapacitated.",
            "{@b Savage Attacks.} When you score a critical hit with a melee weapon attack, you can roll one of the weapon's damage dice one additional time and add it to the extra damage of the critical hit."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "con",
              "dex"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Thicker Hide",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "shifter (beasthide)"
            }
          ]
        }
      ],
      "entries": [
        "You draw even greater amounts of strength and stability from the beast within. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Superior Beasthide Shift.} Whenever you shift, the number of d6's you roll to determine your additional temporary health is your character level divided by 4 rounded down (minimum of 1d6). While you have temporary hitpoints from shifting, you gain resistance you piercing, slashing, and bludgeoning damage from nonmagical sources."
          ]
        }
      ],
      "ability": [
        {
          "con": 1
        }
      ]
    },
    {
      "name": "The Alpha",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "shifter (longtooth)"
            }
          ]
        }
      ],
      "entries": [
        "You are particulary ferocious and aggressive for a Longtooth. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Pack Leader.} While shifted, if a creature you can see that is within 5 feet of you makes an attack on an ally, you can use your reaction to make an opportunity attack. If the attack hits, your ally gains +2 AC for the purposes of determing whether or not the triggering attack hits.",
            "{@b Ferocious Bite.}  Your fang unarmed weapon deals {@dice 2d6} + your Strength modifier when you reach 8th level and {@dice 3d6} + your Strength modifier when you reach 15th level."
          ]
        }
      ],
      "ability": [
        {
          "str": 1
        }
      ]
    },
    {
      "name": "Aspect of the Cheetah",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "shifter (swiftstride)"
            }
          ]
        }
      ],
      "entries": [
        "You put the swift in swiftstride. Your speed and grace have to be seen to be believed. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Superior Grace.} You gain expertise in Dexterity (Acrobatics) checks.",
            "{@b Superior Speed.} Your walking speed increases by 5 additional feet. While shifted, your walking speed increases by 15 feet rather than 10, you may Dash as a bonus action, and can now move up to half your movement speed if an enemy ends its turn within 5 feet of you. Due to the dizzying speed, if more than 1 creature would make an opportunity attack due to this movement, instead only 1 may make an opportunity attack."
          ]
        }
      ],
      "ability": [
        {
          "dex": 1
        }
      ]
    },
    {
      "name": "Predatory Instinct",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "shifter (wildhunt)"
            }
          ]
        }
      ],
      "entries": [
        "You are an exceptional hunter even for a Wildhunt shifter. Only the most exceptional of quarries have a chance to escape once you're on their trail. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Natural Vigilence.} You cannot be surprised by wild beasts, monstrosities, or plants. Additionally, while outside of a town, you can add your proficiency bonus to initiative rolls.",
            "{@b Expert Hunter.} While shifted, you gain proficiency (if you already proficienct, instead gain expertise) in Wisdom skill checks in addtion to the usual advantage."
          ]
        }
      ],
      "ability": [
        {
          "wis": 1
        }
      ]
    },
    {
      "name": "True Transformation",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "shifter"
            }
          ]
        }
      ],
      "entries": [
        "The blood of the werebeast in your ancestry runs thicker in your veins than other shifters. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Wereblooded.} When you take this feat, your Shifting ability lasts for 10 minutes rather than 1 minute. When you reach 8th level, it lasts for 1 hour. Regardless of the duration of your Shifting ability, you may choose to concentrate on it as if you were concentrating on a spell to extend its duration. Whenever you take damage, you must make concentration checks as normal. If you fail a concentration check or the duration extends to double its normal duration, your Shifting ability ends."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "con",
              "dex",
              "str"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Simic Mutation",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "simic hybrid"
            }
          ]
        }
      ],
      "entries": [
        "As an apex of evolution, you gain the following benefits:",
        "You can take this feat more than once, choosing a new animal enhancement each time.",
        {
          "type": "list",
          "items": [
            "{@b Mutagenic.} You gain one Simic Hybrid animal enhancement you don't already have for which you meet the requirements."
          ]
        }
      ],
      "ability": [
        {
          "con": 1
        }
      ]
    },
    {
      "name": "Volatile Subject",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "simic hybrid"
            }
          ]
        }
      ],
      "entries": [
        "The scientists who created you have thrown caution to the wind. Your Animal Enhancements are stronger than than other Simics but the magic used to enhance you is extremely unstable. As a bonus action, you can activate your expirimental abilities which last for 1 hour. All animal enhancements you currently have are affected. At the end of the hour, roll on the Wild Magic Surge table. The {@dice 1d20} roll to determine the severity table to roll on is made with a -3 modifier and a further amount equal to the number of Animal Enhancements you currently have is subtracted from the result (minimum result is 1). Once you use this ability, you cannot use it again until you complete a long rest. These additional abilities are detailed in the Experimental Enhancements table.",
        {
          "type": "table",
          "caption": "Experimental Enhancements Table",
          "colLabels": [
            "Animal Enhancement",
            "Experitmental Enhancement"
          ],
          "colStyles": [
            "col-2 text-left",
            "col-10 text-left "
          ],
          "rows": [
            [
              "{@b Manta Glide.}",
              "{@b Experimental Fins.} You gain the benefits of the {@spell feather fall} passively while using Manta Glide. Additionally, you can move horizontally 10 feet for every 1 foot you fall."
            ],
            [
              "{@b Nimble Climber.}",
              "{@b Chameleon Climbing Apparatus.} You gain an additional 10 feet of climbing speed. If you remain still while climbing or against a wall for at least 6 seconds your body shifts colors to match the surface behind you. You are considered lightly obscured in bright light, heavily obscured in dim light, and invisible and silent in darkness as long as you move less 10 feet per turn and stay within 5 feet of a wall or vertical surface."
            ],
            [
              "{@b Underwater Adaption.}",
              "{@b Enhanced Sea Adaptation} Your gain an additional 10 feet of swim speed. You learn the {@spell shape water|xge} cantrip while Experimental Enhancements are active. You gain advantage on saving throws against ice and water based magic. Finally, you gain advantage on attack rolls (including spell attacks) while swimming."
            ],
            [
              "{@b Grappling Appendages.}",
              "{@b Lengthened Muscle Fibres.} The reach of your appendages increases to 10 feet. You gain proficiency in Strength (Athletic) checks when using your appendages. If you already have proficiency, then you gain expertise instead. While a creature is grappled by your grappling appendages, they take 1d4 + your Strength modifier bludgeoning damage at the end of each of their turns where they remain grappled. When you take the shove action on a creature grappled by your appendage and succeed in the Strength (Athletics) contest, the distance they are shoved increases to 15 feet and you can shove them in any direction (including straight into the air) and they fall prone."
            ],
            [
              "{@b Carapace.}",
              "{@b Improved Shell.} You gain resistance to nonmagical bludgeoning, piercing, and slashing damage. You gain one Carapace Die which is a d12 which goes away when Experimental Enhancements ends. You can use the Carapace Die to reduce the damage of any damage roll made against you. If you reduce the damage below 0 points, you gain 1 AC for every damage point mitigated below 0. You retain this AC until you take damage or Experimental Enhancements ends. You gain a Carapace Die every time you roll for inititive up to a maximum of 1 total."
            ],
            [
              "{@b Acid Spit.}",
              "{@b Improved Noxious Glands.} Any creature within 5 feet of you that hits you with a melee attack must make a Constitution save against your Acid Spit DC or take {@dice 1d4} poison damage. This damage increase to {@dice 2d4} at 11th level and {@dice 3d4} at 17th level. Additionally, your melee attacks deal {@dice 1d4} acid damage. This damage increases to {@dice 1d8} at level 11, and to {@dice 1d10} at 17th level."
            ]
          ]
        }
      ]
    },
    {
      "name": "Combine Amalgam",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "simic hybrid"
            }
          ]
        }
      ],
      "entries": [
        "You are simultaneously both vedalken and elvish. You can the following benefit:",
        "You can take this feat more than once, choosing a new a racial feat each time.",
        {
          "type": "list",
          "items": [
            "{@b Perfect Hybrid.} When you take this feat, you choose to gain either an Elven racial feat or a Vedalken racial feat. You may take this feat multiple times, choosing a new racial feat each time."
          ]
        }
      ]
    },
    {
      "name": "Feline Grace",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "tabaxi"
            }
          ]
        }
      ],
      "entries": [
        "Your incredible reflexes and agility further improve. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "You can use your Feline Agility trait twice before you must move 0 feet on one of your turns to use the trait again. You can still only use this ability once per turn when you move.",
            "If you would take damage from falling, treat the damageas if you fell 20 feet less."
          ]
        }
      ],
      "ability": [
        {
          "dex": 1
        }
      ]
    },
    {
      "name": "Feline Jumping",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "tabaxi"
            }
          ]
        }
      ],
      "entries": [
        "You're even more athletic than the typical Tabaxi. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "You can now long jump a distance equal to 20 + your Strength modifier (minimum 20). Additionally, you can high jump a distance of 15 feet and your high jumps no longer require running starts.",
            "You gain proficiency in the Acrobatics or Athletics skills."
          ]
        }
      ],
      "ability": [
        {
          "dex": 1,
          "str": 1
        }
      ]
    },
    {
      "name": "Fickle Fascination",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "tabaxi"
            }
          ]
        }
      ],
      "entries": [
        "Your interests change from day to day, but when something captures your attention, even fleetingly, you dive head first into it. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "After taking a long rest, choose any skill you don't have expertise in. You may add half your proficiency bonus rounded down to this skill."
          ]
        }
      ]
    },
    {
      "name": "Barbed Hide",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "tiefling"
            }
          ]
        }
      ],
      "entries": [
        "One of your ancestors was a barbed devil or other spiky fiend. Barbs protrude from your head. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Spiked Carapace.} As a bonus action, you can cause small barbs to protrude all over your body. At the start of each of your turns while the barbs are out, you deal {@dice 1d6} piercing damage per 5 character levels (to a max of {@dice 4d6} at 20th level) to any creature grappling you or any creature grappled by you at the start of your turn. The barbs last for 1 minute. Once you use this triat, you cannot do so again until you finish a long rest.",
            "{@b Fiendish Visage.} You gain proficiency in the Intimidation skill. If you're already proficient in it, your proficiency bonus doubles."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "con",
              "cha"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Tortle Protector",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "tortle"
            }
          ]
        }
      ],
      "entries": [
        "You have mastered using your shell to better protect yourself and others. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "Your natural armor trait now provides a base AC of 18. As normal, your Dexterity modifier doesn't affect this number.",
            "As a reaction when you are forced to make a Dexterity saving throw, choose any number of creatures within 5 feet of you. Each chosen creature is considered to have half-cover against any harmful attacks or effects while within 5 feet of you until the start of your next turn. Once you use this ability, you can't do so again until you've finished a short or long rest."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "str",
              "wis"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Snapping Tortle",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "tortle"
            }
          ]
        }
      ],
      "entries": [
        "Your mouth is shaped different than other Tortles and can snap bones in two. You don't shy away from fights and this has made you tough. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Hardened Shell.} Your shell grants you an additional natural +1 to your AC. Additionally, whenever a creature makes an attack roll against you, you can use your reaction to impose disadvantage on that roll. Once you use this feature you cannot to so again until you finish a short or long rest.",
            "{@b Snapping Jaws.} Your bite is a natural weapon which takes a bonus action to use. It deals damage equal to 1d6 + your Strength modifier."
          ]
        }
      ]
    },
    {
      "name": "Arcane Shell",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "tortle"
            }
          ]
        }
      ],
      "entries": [
        "Your mouth is shaped different than other Tortles and can snap bones in two. You don't shy away from fights and this has made you tough. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Warding Sigil.} During a long rest you can spend one hour tracing a ward for the {@spell shield} spell on your shell. Once done you can cast the spell once without expanding a spell slot o rmaterial components, once used in this way the ward needs to be retraced before it can be used again.",
            "{@b Hardened Mind.} When using your Shell Defense and the ward is still active, your wards also grant you advantage on saving throws."
          ]
        }
      ]
    },
    {
      "name": "Triton Deep Magic",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "triton"
            }
          ]
        }
      ],
      "entries": [
        "You master more of the magic of elemental air and water. You learn the {@spell create or destroy water} spell and can cast it as a 1st level spell at will, without expending a spell slot. You also learn {@spell warding wind|phb} and {@spell water breathing}, each of which you can cast once without expending a spell slot. You regain the ability to cast those two spells in this way when you finish a long rest. Charisma is your spellcasting ability for all three spells."
      ]
    },
    {
      "name": "Maelstrom Sentinel",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "triton"
            }
          ]
        }
      ],
      "entries": [
        "You are a keeper of the depths, ever vigilant for threats against the sea and mighty is your fury. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Deep Sea Combat.} While you are submerged in water, you have advantage on all attacks of opportunity",
            "{@b Electric Eel.} You learn the {@spell Shocking Grasp} cantrip.",
            "{@b Elemental Fury.} You learn two 1st level and one 2nd level evocation spell from the wizard or sorcerer spell lists of your choice, each of which can be cast without expending a spell slot. Once a spell is cast using this feature, it can't be cast using this feature again until you complete a long rest."
          ]
        }
      ]
    },
    {
      "name": "Reflective Scales",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "triton"
            }
          ]
        }
      ],
      "entries": [
        "Shimmering scales cover your body and do more than help you look flashy as you move about. These scales allow you to turn harmful effects back upon their source or onto other threats nearby. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Reflect Elements.} As a reaction whenever you take acid, fire, lightning, or cold damage, you can have another creature of your choice within 60 feet take the same amount and type of damage. Once you use this feature, you cannot do so again until you finish a short or long rest."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "str",
              "cha",
              "con"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Rigorous Precision",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "vedalken"
            }
          ]
        }
      ],
      "entries": [
        "Every imperfection is a chance for improvement and resting just gets in the way of the pursuit. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Improved Tireless Precision.} Choose an additional skill or tool to gain proficiency in. The chosen skill is also affected by your Tireless Precision trait. Additionally, choose one skill or tool with which your Tireless Precision affects. You instead roll {@dice 2d4} and add it to ability checks made with the chosen skill or tool."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "int",
              "wis"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Expert Precision",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "vedalken"
            }
          ]
        }
      ],
      "entries": [
        "You have lasered your focus onto a single task and achieved mastery. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Expertise.} You gain expertise in the skill chosen as part of your Tireless Precision trait.",
            "{@b Transferable Knowledge.} Your Tireless Precision die becomes a {@dice 1d6}."
          ]
        }
      ]
    },
    {
      "name": "Primal Blood",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "vedalken"
            }
          ]
        }
      ],
      "entries": [
        "Sometimes progress requires going back to the beginning. You've altered your body to be more in line your animal ancestors. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Aquatic Ancestry.} You can now breathe underwater for an unlimited duration.",
            "{@b Sea Sight.} You gain Darkvision. You can see in dim light within 60 feet as if it were bright light, and in Darkness as if it were dim light. You can't discern color in Darkness, only Shades of Gray. This bonus is doubled underwater."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "con",
              "wis"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Envoy Augmentations",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "warforged"
            }
          ]
        }
      ],
      "entries": [
        "Receiving permanent specialised enhancements, you gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Specialized Design.} You gain one skill proficiency of your choice, one tool proficiency of your choice, and fluency in one language of your choice.",
            "{@b Integrated Tool.} Choose one tool you're proficient with. This tool is integrated into your body, and you double your proficiency bonus for any ability checks you make with it. You must have your hands free to use this integrated tool."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "str",
              "dex",
              "con",
              "int",
              "wis",
              "cha"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Fabricated Skirmisher",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "warforged"
            }
          ]
        }
      ],
      "entries": [
        "Receiving permanent scout-like enhancements, you gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Swift.} Your walking speed increases by 5 feet",
            "{@b Light Step.} When you are traveling alone for an extended period of time (one hour or more), you can move stealthily at a normal pace. (See chapter 8 of the Player's Handbookfor information about travel pace.)",
            "{@b Skirmisher.} You have advantage on Initiative rolls. If you would already have advantage, you instead go first in the initiative order."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "dex",
              "wis"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Living Tank",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "warforged"
            }
          ]
        }
      ],
      "entries": [
        "Receiving permanent juggernaut-like enhancements, you gain the following features:",
        {
          "type": "list",
          "items": [
            "{@b Iron Fists.} When you hit with an unarmed strike, you can deal bludgeoning damage equal to {@dice 1d6} + your Strength modifier, instead of the normal damage for an unarmed strike.",
            "{@b Powerful Build.} You count as one size larger when determining your carrying capacity and the weight you can push, drag, or lift.",
            "{@b Juggernaut.} You gain an additional +1 to your AC, but you have disadvantage on Dexterity saving throws. After finishing a long rest you can choose to ignore the Juggernaut feature until you finish your next rest long rest."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "str",
              "con"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Overdrive",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "warforged"
            }
          ]
        }
      ],
      "entries": [
        "You can force your energy consumption to surge for a brief moment. You gain the following benefit:",
        {
          "type": "list",
          "items": [
            "{@b Overdrive.} You can push yourself beyond your normal limits for a moment. On your turn, you can take one additional action on top of your regular action and a possible bonus action. At the end of your turn, you immediately gain a level of exhaustion."
          ]
        }
      ]
    },
    {
      "name": "Serpent Form",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "yuan-ti pureblood"
            }
          ]
        }
      ],
      "entries": [
        "You have unlocked more of your serpentfolk heritage. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "You can use an action to polymorph into a Medium snake or back into your true form. Your statistics are the same in each form. Any equipment you are wearing or carrying isn't transformed. If you die, you stay in your current form",
            "While in snake form, you gain a bite attack as a natural weapon, which you can use to make unarmed strikes. If you hit with it, you deal piercing damage equal to {@dice 1d4} + your Strength modifier, instead of the bludgeoning damage normal for an unarmed strike. When you hit with a bite attack, you can choose to deal {@dice 2d6} additional poison damage to the target. Once you deal this poison damage, you can't do so again until you finish a long rest."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "int",
              "cha"
            ],
            "amount": 1
          }
        }
      ]
    },
    {
      "name": "Venomous Serpent",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "yuan-ti pureblood"
            }
          ]
        }
      ],
      "entries": [
        "Your venom flows more easily than other Yuan-Ti. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Potent Venom.} When you make an attack using Charisma, Intelligence, or Dexterity, you may reroll any damage dice that land on 1 and you must use the new roll.",
            "{@b Venomous River.} When you land a critical strike on a creature using Charisma, Intelligence, or Dexterity, the creature must make a saving throw of DC 8 + your proficiency bonus + the modifier you used for the attack. On a failed save, the creature becomes Poisoned and takes {@dice 1d8} Poison damage. This damage increases to {@dice 2d8} at 8th level and to {@dice 3d8} at 15th level. On a successful save, the creature is not Poisoned and takes half the Poison damage"
          ]
        }
      ]
    },
    {
      "name": "Serpentine Stride",
      "source": "RacialFeatsExpandedFedor",
      "prerequisite": [
        {
          "race": [
            {
              "name": "yuan-ti pureblood"
            }
          ]
        }
      ],
      "entries": [
        "You can use your serpentine like body to maneuver around very quickly. You gain the following benefits:",
        {
          "type": "list",
          "items": [
            "{@b Speedy Slither.} Your walking speed increases by 5 feet.",
            "{@b Hunting Sprint.} When you dash, add an additional half of your movement speed (rounded down) to the total speed."
          ]
        }
      ],
      "ability": [
        {
          "choose": {
            "from": [
              "dex"
            ],
            "amount": 1
          }
        }
      ]
    }
  ]
}
